    <h1 class="pt-4 fs-4" tabindex="0">
		А11Y (Accessibility):
	</h1>

	<p class="pt-4 fs-6" tabindex="0">	
        Когато уебсайтовете и уеб инструментите са правилно проектирани и кодирани, хората с увреждания могат да ги използват. Въпреки това в момента много сайтове и  инструменти се разработват с бариери за достъпност, които ги правят трудни или невъзможни за използване от някои хора. 
        Достъпният уеб има ползи за индивиди, бизнеса и обществото. Международните уеб стандарти определят какво е необходимо за достъпност.
	</p>   
	
	<p class="fs-6" tabindex="0">	
    	<span class="fw-semibold">Уебът</span> е фундаментално проектиран да функционира за всички хора, независимо от техните <span class="fw-semibold">устройства, софтуер, език, местоположение или способности</span>. Когато уебът постигне тази цел, той става достъпен за хора с разнообразен <span class="fw-semibold">слух, движение, зрение и когнитивни способности</span>.
    	Така въздействието на уврежданията се променя радикално върху уеба, тъй като уебът премахва бариерите за комуникация и взаимодействие, с които много хора се сблъскват в физическия свят. Въпреки това, когато уебсайтовете, приложенията, технологиите или инструментите са лошо проектирани, те могат да създадат бариери, които изключват хората от използването на уеба.
    	Достъпността е от съществено значение за разработчиците и организациите, които искат да създават уебсайтове и уеб инструменти с високо качество, без да изключват хората от използването на техните продукти и услуги.
	</p>

    <p class=" fs-4" tabindex="0">	
    	Достъпността на уеба означава, че уебсайтовете, инструментите и технологиите са проектирани и разработени така, че хората с увреждания да могат да ги използват. 
	</p>

    <p class="fs-6" tabindex="0">	
   		Конкретно хората могат да: <span class="fw-semibold">възприемат, разбират, навигират, допринасят и взаимодействат с уеба</span>.
	</p>

	

    <div class="row pt-4 fs-6">
		<div class="col-6">
			<p class="fs-6" tabindex="0">	
				Достъпността на уеба обхваща всички увреждания, които засягат достъпа до уеба, включително:
			</p>

			<ul tabindex="0">
				<li tabindex="0">
                    Слухови
				</li>

				<li class="mt-2" tabindex="0">
                    Когнитивни
				</li>

				<li class="mt-2" tabindex="0"> 
                    Неврологични
				</li>

                <li class="mt-2" tabindex="0">
                    Физически
				</li>

				<li class="mt-2" tabindex="0">
                    Говорни
				</li>

				<li class="mt-2" tabindex="0"> 
                    Зрителни
				</li>
			</ul>	     
		</div>

		

		<div class="col-6">
			<p class="fs-6" tabindex="0">	
        	    Достъпността на уеба също така предоставя ползи на хората без увреждания, например:
	    	</p>

			<ul>
				<li tabindex="0">
                    Хора, използващи мобилни телефони, умни часовници, смарт телевизори и други устройства с малки екрани, различни начини на въвеждане 
				</li>

				<li class="mt-2" tabindex="0">
                    По-възрастни хора с променящи се способности поради стареене
				</li>

                <li class="mt-2" tabindex="0">
                    Хора с "временни увреждания" като счупена ръка или изгубени очила
				</li>

				<li class="mt-2" tabindex="0">
                    Хора с "ситуационни ограничения", като ярка слънчева светлина или среда, в която не могат да слушат аудио
				</li>

                <li tabindex="0">
                    Хора, използващи бавна интернет връзка или с ограничена или скъпа лента
				</li>
			</ul>	     
		</div>
	</div>
	
