    <h2 class="pt-4 fs-4">
		А11Y (Accessibility):
	</h2>

	<p class="pt-4 fs-6">	
        Когато уебсайтовете и уеб инструментите са правилно проектирани и кодирани, хората с увреждания могат да ги използват. Въпреки това в момента много сайтове и  инструменти се разработват с бариери за достъпност, които ги правят трудни или невъзможни за използване от някои хора. 
        Достъпният уеб има ползи за индивиди, бизнеса и обществото. Международните уеб стандарти определят какво е необходимо за достъпност.
	</p>   
	
	<p class="pt-4 fs-6">	
    Уебът е фундаментално проектиран да функционира за всички хора, независимо от техните устройства, софтуер, език, местоположение или способности. Когато уебът постигне тази цел, той става достъпен за хора с разнообразен слух, движение, зрение и когнитивни способности.

    Така въздействието на уврежданията се променя радикално върху уеба, тъй като уебът премахва бариерите за комуникация и взаимодействие, с които много хора се сблъскват в физическия свят. Въпреки това, когато уебсайтовете, приложенията, технологиите или инструментите са лошо проектирани, те могат да създадат бариери, които изключват хората от използването на уеба.

    Достъпността е от съществено значение за разработчиците и организациите, които искат да създават уебсайтове и уеб инструменти с високо качество, без да изключват хората от използването на техните продукти и услуги.
	</p>

    <p class=" fs-4">	
    Достъпността на уеба означава, че уебсайтовете, инструментите и технологиите са проектирани и разработени така, че хората с увреждания да могат да ги използват. 
	</p>

    <p class="fs-6">	
   Конкретно хората могат да: възприемат, разбират, навигират, допринасят и взаимодействат с уеба.
	</p>

   

    <div class="row pt-4 fs-6">
        

		<div class="col-6">
            <p class="fs-6">	
                Достъпността на уеба обхваща всички увреждания, които засягат достъпа до уеба, включително:
	        </p>
        
			<p>
				<ul>
					<li>
                        Слухови
					</li>

					<li class="mt-2">
                        Когнитивни
					</li>

					<li class="mt-2"> 
                        Неврологични
					</li>

                    <li>
                        Физически
					</li>

					<li class="mt-2">
                        Говорни
					</li>

					<li class="mt-2"> 
                        Зрителни
					</li>
				</ul>	 
			</p>     
		</div>

        

		<div class="col-6">
            <p class="fs-6">	
                Достъпността на уеба също така предоставя ползи на хората без увреждания, например:
	        </p>

			<p>
				<ul>
					<li>
                        Хора, използващи мобилни телефони, умни часовници, смарт телевизори и други устройства с малки екрани, различни начини на въвеждане 
					</li>

					<li class="mt-2">
                        По-възрастни хора с променящи се способности поради стареене
					</li>

                    <li>
                        Хора с "временни увреждания" като счупена ръка или изгубени очила
					</li>

					<li class="mt-2">
                        Хора с "ситуационни ограничения", като ярка слънчева светлина или среда, в която не могат да слушат аудио
					</li>

                    <li>
                        Хора, използващи бавна интернет връзка или с ограничена или скъпа лента
					</li>
				</ul>	
			</p>     
		</div>
	</div>

	
