<h2 class="pt-4 fs-4">
 BEM
</h2>

	<p class="pt-4 fs-6">
        Block Element Modifier е конвенция за именуване и методология за писане на поддържаем и мащабируем CSS код. Тя цели да създаде ясна и предсказуема структура за CSS класовете, което прави по-лесно разбирането, сътрудничеството и поддържането на код в по-големи проекти. BEM разделя компонентите на интерфейса ви на три основни категории: Блокове (Blocks), Елементи (Elements) и Модификатори (Modifiers).
    </p>

	<div class="row fs-6">
		<div class="col-6">
			<p>
				<ul>
					<li>
                    Блок (Block):

Блокът е независим компонент на високо ниво, който има собствено стилизиране.
Той представлява значима отделна единица, като например навигационно меню, заглавие, карта и др.
Класовете за блокове са написани с малки букви и разделени с тирета, например .navbar, .header, .card.                    </li>	

					<li class="mt-2">
                    Елемент (Element):

Елементът е част от блок, която не може да се използва самостоятелно.
Той зависи от блока за своето значение и стил.
Класовете за елементи са именувани с името на блока, следвано от двойно подчертаване и името на елемента, например .navbar__item, .header__logo, .card__title.                    </li>

                    <li class="mt-2">
                    Модификатор (Modifier):

Модификаторът е клас, който модифицира външния вид или поведението на блок или елемент.
Той се използва за предоставяне на вариации или състояния на блоковете или елементите.
Класовете за модификатори са именувани с името на блока или елемента, следвано от двойно тире и името на модификатора, например .navbar--dark, .button__primary--large, .card--featured.                   </li>
		
                </ul>	 
			</p>     
		</div>

		<div class="col-6">
            <p class="fs-4">	
                 Предимства на BEM:
             </p>
				<ul>
					<li>
                        Модулност: BEM насърчава модулна структура, която прави управлението и поддръжката на CSS компоненти по-лесни.                    
                    </li>

					<li class="mt-2">
                        Предсказуемо Именуваане: Именуването е описателно и самообяснително, което води до по-добра четливост.
                    </li>

                    <li class="mt-2">
                        Локално Стилизиране: Стиловете на всеки компонент са съдържани в собствените им класове, което намалява непредвидените глобални стилови конфликти.
                    </li>	
                    
                    <li class="mt-2">
                        Повторно Използване: Блоковете и елементите могат да се използват отново в различни части на проекта без конфликти.
                    </li>	

                    <li class="mt-2">
                        Сътрудничество: Стандартната конвенция за именуване и ясната структура правят сътрудничеството между разработчиците по-ефективно.
                    </li>	
                </ul>	
			</p>     
		</div>
	</div>
    
    <p class="pt-4 fs-4">	
        Пример в HTML и CSS:    
    </p>

    <p class="codepen" data-height="300" data-theme-id="dark" data-default-tab="html,result" data-slug-hash="poQMXyg" data-editable="true" data-user="obama-max" style="height: 300px; box-sizing: border-box; display: flex; align-items: center; justify-content: center; border: 2px solid; margin: 1em 0; padding: 1em;">
    <span>See the Pen <a href="https://codepen.io/obama-max/pen/poQMXyg">
    BEM example</a> by Darius Popov (<a href="https://codepen.io/obama-max">@obama-max</a>)
    on <a href="https://codepen.io">CodePen</a>.</span>
    </p>

    <p class="pt-4 fs-6">
        BEM помага да се създаде структуриран и последователен подход за писане на CSS, който има полза както за разработката, така и за поддръжката, особено в по-големи и по-сложни проекти.
    </p>