<h2 class="pt-4 fs-4">
Блок елементи
</h2>

	<p class="pt-4 fs-6">
   
    В HTML елементите се категоризират в два основни типа: блокови елементи (block-level elements) и инлайн елементи (inline elements). Блоковите елементи създават блокова кутия, което означава, че те започват на нов ред и заемат цялата налична ширина в рамките на своя родителски контейнер. Тези елементи обикновено се използват за структуриране и организиране на съдържанието на уеб страница.

	</p>

	<p class="pt-4 fs-4">	
        Ето повече информация за блоковите елементи:
    </p>	

	<div class="row fs-6">
		<div class="col-6">
			<p>
				<ul>
					<li>
                        Често срещани блокови елементи: Някои общи примери за блокови елементи включват "div", "p", "h1" до "h6", "ul", "ol", "li", "table", "form" и други.
                    </li>	

					<li class="mt-2">
                    Структурна роля: Блоковите елементи често се използват за създаване на основната структура на уеб страница. Те се използват за дефиниране на секции, параграфи, заглавия, списъци и други значими части на съдържанието.	
                </ul>	 
			</p>     
		</div>

		<div class="col-6">
			<p>
				<ul>
					<li>
                    Нов ред и пълна ширина: Блоковите елементи започват на нов ред, като следващите елементи се показват под тях. Също така, те се разширяват, за да заемат пълната ширина на своя родителски контейнер по подразбиране.

                    </li>

					<li class="mt-2">
                    Оформление и оформление: Блоковите елементи могат да бъдат оформени с помощта на CSS, за да се контролира тяхния външен вид, включително свойства като ширина, височина, отстъп, падинг и цвят на фона. Те са основата за създаване на оформления и структуриране на съдържанието.                    </li>				
				</ul>	
			</p>     
		</div>
	</div>	
	
    <p class="codepen" data-height="300" data-theme-id="dark" data-default-tab="html,result" data-slug-hash="eYQqGwd" data-editable="true" data-user="obama-max" style="height: 300px; box-sizing: border-box; display: flex; align-items: center; justify-content: center; border: 2px solid; margin: 1em 0; padding: 1em;">
  <span>See the Pen <a href="https://codepen.io/obama-max/pen/eYQqGwd">
  Block elements</a> by Darius Popov (<a href="https://codepen.io/obama-max">@obama-max</a>)
  on <a href="https://codepen.io">CodePen</a>.</span>
    </p>

    <p class="pt-4 fs-6">
В този пример "h1", "p", "ul" и "div" са всички блокови елементи. Те започват на нов ред и заемат цялата ширина на своя родителски контейнер.

Блоковите елементи играят важна роля в структурирането на съдържанието и оформлението на уеб страница, което улеснява създаването на добре организирани и визуално атрактивни дизайни.
    </p>

