<h2 class="pt-4 fs-4">
Bootstrap 
</h2>

	<p class="pt-4 fs-6">
        Bootstrap е популярна предница (front-end) рамка (framework), която предоставя набор от предварително изградени дизайн компоненти и инструменти, които помагат на разработчиците да създават отзивчиви и визуално привлекателни уеб сайтове и уеб приложения. Тя е предимно базирана на HTML, CSS и JavaScript и опростява процеса на проектиране и структуриране на уеб съдържание, като предлага последователна и гъвкава система за мрежа (grid), както и разнообразие от компоненти за потребителски интерфейс.    
    </p>

    <p class="fs-4">	
        Ето ключовите характеристики и концепции на Bootstrap:
    </p>

	<div class="row fs-6">
		<div class="col-12">
			<p>
				<ul>
					<li>
                        Отзивчив Дизайн - Bootstrap е проектиран да създава отзивчиви уеб сайтове, които автоматично се адаптират към различни размери на екрана и устройства, като смартфони, таблети и настолни компютри.
                    </li>	

					<li class="mt-2">
                        Система за Мрежа (Grid): Мрежовата система на Bootstrap е основна част от нейната структура на изглед. Тя е базирана на 12-колонова мрежа, която позволява на разработчиците да създават гъвкави и отзивчиви макети. Класовете за мрежата се използват, за да се определи как трябва да бъдат позиционирани и показани елементите на различни размери на екрана.     
                    </li>

                    <li class="mt-2">
                        Компоненти: Bootstrap предоставя широка гама предварително стилизирани компоненти за потребителски интерфейс, като бутони, форми, навигационни ленти, картички, модални прозорци и други. Тези компоненти могат лесно да бъдат персонализирани и интегрирани в проектите ви.
                    </li>

                    <li class="mt-2">
                        Типография: Bootstrap включва набор от стилове и класове за типография за заглавия, параграфи, списъци и други текстови елементи, за да поддържа последователна и визуално приятна структура на текста.
                    </li>

                    <li class="mt-2">
                        CSS Класове: Bootstrap използва CSS класове за стилизиране на елементи. Като добавите подходящи имена на класовете във вашия HTML маркировъчен език, можете да приложите предварително дефинирани стилове и поведения, предоставени от Bootstrap.
                    </li>

                    <li class="mt-2">
                        Условни Класове: Bootstrap включва разнообразие от условни класове, които предлагат бързи решения за общи стилови нужди, като отстояние, падинг, насочване на текста, цветове и други.
                    </li>

                    <li class="mt-2">
                        JavaScript Плъгини: Bootstrap предлага JavaScript плъгини, които добавят интерактивност и подобрена функционалност на компонентите. Те включват функции като карусели, подсказки, модални прозорци, падащи менюта и други.
                    </li>

                    <li class="mt-2">
                        Темиране: Bootstrap позволява персонализиране на общия външен вид и усещане на вашия проект, като прилагате теми. Можете да изберете от предварително дефинирани теми или да създадете своя собствена с помощта на вградените възможности за темиране на Bootstrap.
                    </li>

                    <li class="mt-2">
                        Интеграция с Други Инструменти: Bootstrap може лесно да бъде интегриран с други предни инструменти и библиотеки, което я прави универсална за различни настройки на проекти.
                    </li>
                </ul>	 
			</p>     
		</div>
	</div>
    
    <p class="pt-4 fs-4">	
    <a href="https://getbootstrap.com/docs/5.3/examples/album/#"> Ето прост пример за използване на мрежовата система на Bootstrap.</a>   
    </p>


    

    <p class="pt-4 fs-6">
    Популярността на Bootstrap идва от неговата способност да спестява време за разработка, да предоставя последователни дизайнерски модели и да прави отзивчивия дизайн по-достъпен за разработчици на всички нива на умения.    </p>