<h2 class="pt-4 fs-4">
Box Model (Модел на кутията в CSS)
</h2>

	<p class="pt-4 fs-6">
   
    Модел на кутията в CSS е основно понятие, което обяснява как са структурирани елементите в уеб страница и как се изчисляват техните размери и разстояния. Той включва четири основни компонента: съдържание, падинги, граница и маргини. Тези компоненти заедно определят размера и позиционирането на елемент на страницата.</p>


	<p class="pt-4 fs-4">	
        Ето преглед на всеки компонент в CSS Box Model:    
    </p>	

	<div class="row fs-6">
		<div class="col-12">
			<p>
				<ul>
					<li>
                    Съдържание:

Това е реалното съдържание на HTML елемент, като текст, изображения или други медийни елементи.
Ширината и височината на областта за съдържание на елемента се определят от свойствата width и height в CSS.                    </li>	

					<li class="mt-2">
                    Падинги:

Падингите са разстоянието между съдържанието и границата на елемента.
Те помагат за създаването на вътрешно разстояние в елемента.
Падингите могат да се задават с помощта на свойството padding. Можете да зададете различни стойности за всяка страна (горе, дясно, долу, ляво) или да използвате съкратен формат.                    </li>

                    <li class="mt-2">
                    Граница:

Границата заобикаля падингите и областта за съдържание, дефинирайки визуалната граница на елемента.
Можете да зададете стил, цвят и ширина на границата с помощта на свойството border.
Свойствата за границата включват border-style, border-color и border-width.                   </li>

                   <li class="mt-2">
                   Маргини:

Маргините са разстоянието извън границата на елемента, създавайки разстояние между съседни елементи.
Те помагат за управление на разстоянието между елементите на страницата.
Маргините могат да се задават с помощта на свойството margin. Подобно на падингите, можете да зададете стойности за всяка страна или да използвате съкратен формат.                   </li>		
                </ul>	 
			</p>     
		</div>
	</div>
    

    <p class="pt-4 fs-6">
    Общите размери на един елемент включват съдържанието, падингите, границата и маргините. При изчисляването на общата ширина на елемент трябва да се вземат предвид сумата от ширината на съдържанието, лявите и десните падинги, ширините на левата и дясната граница, както и левите и десните маргини. Подобно на това, при изчисляването на общата височина на елемент трябва да се вземат предвид височината на съдържанието, горните и долните падинги, височините на горната и долната граница, както и горните и долните маргини.
    </p>

    <p class="pt-4 fs-4">	
        Ето визуално представление на CSS Box Model:    
    </p>


    <div class="row align-items-center">
    <img src="./assets/images/CSS2.png" style="height: 300px; width: 600px;" alt="snimka lul">

    <p class="pt-4 fs-6 col-6">
    Разбирането на CSS Box Model е съществено за създаване на добре оформлени и правилно разположени макети на уеб страниците. Той гарантира, че имате пълен контрол върху размерите и разстоянията на вашите елементи, като ви помага да постигнете желания визуален вид на вашия уеб сайт.    </p>
	</div>

