<h2 class="pt-4 fs-4">
Бутоните в HTML и как да ги стилизирате с CSS
</h2>

	<p class="pt-4 fs-4">	
        HTML Елемент за Бутон:
    </p>	

    <p class="pt-4 fs-6">   
        HTML елементът "button" се използва за създаване на кликваеми бутони на уеб страници. Бутоните могат да се използват за различни цели, като изпращане на формуляри, стартиране на действия или навигация към различни страници. Ето как можете да използвате елемента "button" в HTML:
    </p>

    
	<p class="pt-4 fs-4">	
        Често използвани атрибути:
    </p>	

	<div class="row fs-6">
		<div class="col-6">
			<p>
				<ul>
					<li>
                        type: Определя поведението на бутона. Стойностите могат да бъдат "button" (по подразбиране), "submit" или "reset". Например: <button type="submit">Изпращане</button>.
                    </li>	

					<li class="mt-2">
                        name и value: Използват се, когато бутона е част от формуляр. Атрибутът name определя името на бутона, а атрибутът value задава стойността, която ще бъде изпратена на сървъра.
                    </li>

                    <li class="mt-2">
                        disabled: Деактивира бутона, като го прави некликлив.
                    </li>

                    <li class="mt-2">
                        onclick: Определя JavaScript функция, която да се изпълни при щракване на бутона.
                    </li>		
                </ul>	 
			</p>     
		</div>
	</div>
    
    <p class="pt-2 fs-4">	
        Стилизиране с CSS:
    </p>

    <p class="pt-4 fs-6">
        Бутоните могат да бъдат стилизирани с помощта на CSS, за да съответстват на дизайна на уеб страницата ви. Ето пример как да стилизирате бутон с CSS:
    </p>

	<p class="codepen" data-height="300" data-theme-id="dark" data-default-tab="html,result" data-slug-hash="abQegwE" data-editable="true" data-user="obama-max" style="height: 300px; box-sizing: border-box; display: flex; align-items: center; justify-content: center; border: 2px solid; margin: 1em 0; padding: 1em;">
    <span>See the Pen <a href="https://codepen.io/obama-max/pen/abQegwE">
    Button</a> by Darius Popov (<a href="https://codepen.io/obama-max">@obama-max</a>)
    on <a href="https://codepen.io">CodePen</a>.</span>
    </p>

    <div class="row fs-6">
		<div class="col-12">
			<p>
				<ul>
					<li>
                        display: inline-block;- Това свойство прави бутона да се държи като инлайн елемент, но позволява на същото време да има свойства на блоков елемент, като ширина и височина.                    
                    </li>	

					<li class="mt-2">
                        padding: 10px 20px;- Добавя падинг (разстояние от вътрешната страна) вътре в бутона. Първата стойност (10px) представлява падинга горе и долу, докато втората стойност (20px) представлява падинга наляво и надясно.                    
                    </li>

                    <li class="mt-2">
                        font-size: 16px;- Задава размера на шрифта на текста на бутона на 16 пиксела.                    
                    </li>

                    <li class="mt-2">
                        background-color: #007bff;- Задава цвета на задния план на бутона на син цвят (#007bff). Можете да използвате всяка валидна стойност за цвят тук.                    
                    </li>

                    <li class="mt-2">
                        color: white;- Задава цвета на текста в бутона на бяло, за да създаде добра контрастност със синия заден план.                    
                    </li>

                    <li class="mt-2">
                        border: none;- Премахва границата около бутона. Това е един начин да стилизирате границата на бутона.                    
                    </li>

                    <li class="mt-2">
                        border-radius: 5px;- Добавя закръглени ъгли на бутона, задавайки радиус на границата от 5 пиксела.                    
                    </li>	

                    <li class="mt-2">
                        cursor: pointer;-Променя вида на курсора в показалеца на мишката, когато се навеждаме върху бутона, което показва, че бутона може да бъде кликнат.                    
                    </li>
                </ul>	 
			</p>     
		</div>
	</div>

    <p class="pt-4 fs-6">
        Псевдокласът :hover се използва, за да приложи стилове, когато мишката се наведе върху бутона. В този случай променяме цвета на задния план на бутона на по-тъмно син (#0056b3), за да се даде визуален отзив при прехвърляне.
        Псевдокласът :active се използва, за да стилизира бутона, когато бъде натиснат. В този случай променяме цвета на задния план на бутона на още по-тъмно син (#003a80), за да покажем, че бутона се натиска.
        Тези CSS правила обединяват се, за да създадат визуално привлекателен и интерактивен елемент бутон. Можете да промените стойностите, за да се адаптират към вашите дизайнерски предпочитания и да интегрирате стиловете в по-големия си проект.
    </p>

    <p class="pt-4 fs-6">
        Помнете, че можете да персонализирате стиловете на бутона допълнително, за да съответстват на вашите предпочитания за дизайн и общия външен вид на уеб страницата ви.
    </p>