
	<h2 class="pt-4 fs-4">
		Субтитри и транскрипции:
	</h2>

	<p class="pt-4 fs-6">	
		Предоставянето на субтитри за мултимедийно съдържание, като видео и аудио, позволява на потребителите с увреден слух да достъпват информацията. Транскрипциите предоставят алтернатива за потребители, предпочитащи четене или използващи програми за четене на екран.
	</p>

	<p class="pt-4 fs-4">	
		Ето някои ключови аспекти на достъпността на субтитрите:
	</p>	

	<div class="row fs-6">
		<div class="col-6">
			<p>
				<ul>
					<li>
						Съответствие със стандартите
					</li>	
					<li class="mt-2">
						Ясен и разбираем текст
					</li>	
					<li class="mt-2"> 
						Синхронизация с видеото
					</li>
				</ul>	 
			</p>     
		</div>

		<div class="col-6">
			<p>
				<ul>
					<li>
						Описание на звуците и звуковите ефекти
					</li>	
					<li class="mt-2">
						Предоставяне на различни езици
					</li>
				</ul>	
			</p>     
		</div>
	</div>	
	
	<p class="pt-4 fs-6">	
		Достъпността на субтитрите е от особено значение, за да се осигури равен достъп до видео съдържанието за всички потребители, включително тези с увреден слух. При качване на видео съдържание, създателите на уеб сайтове и платформи трябва да се грижат за добавянето на коректни и удобни субтитри, които да предоставят ясно разбиране на съдържанието за всички аудитории.
	</p>


