<h2 class="pt-4 fs-4">
 Контейнер
</h2>

	<p class="pt-4 fs-6">
   
    В CSS няма специфичен "container" (контейнер) елемент, но терминът "контейнер" се използва неформално, за да се отнася към блоков елемент, който обгръща и съдържа други елементи в определена секция на уеб страница. Обикновено този елемент се стилизира, за да осигури структура и оформление на съдържанието, което съдържа. Общи примери за елементи-контейнери включват елементи "div" или елементи със специфични имена на класове.


	</p>

	<p class="pt-4 fs-4">	
        Как контейнерите често се използват в CSS:
	</p>	

	<div class="row fs-6">
		<div class="col-6">
			<p>
				<ul>
					<li>
                        Структурна роля: Контейнерите помагат да се структурира оформлението на уеб страница, като групират свързано съдържание заедно. Те могат да разделят страницата на секции, колони или блокове, което прави стилизирането и управлението на съдържанието по-лесно.					
                    </li>	

					<li class="mt-2">
                    Обхват на оформление: Контейнерите ви позволяват да приложите специфични правила за оформление към група от елементи. Можете да зададете клас или идентификатор на контейнер и след това да приложите CSS правила за този клас или идентификатор, което засяга всички елементи в контейнера.					</li>             
				</ul>	 
			</p>     
		</div>

		<div class="col-6">
			<p>
				<ul>
					<li>
                    Адаптивен дизайн: Контейнерите са от съществено значение за създаването на адаптивни дизайни. Като приложите стилове към контейнерите, можете да контролирате как се поведат вложените елементи, когато се промени размерът на екрана.			
                	</li>

					<li class="mt-2">
                    Гъвкавост на оформлението: Контейнерите могат да се използват в съчетание с техники за оформление на CSS като Flexbox или CSS Grid, за да се създадат сложни оформления, които се адаптират към различни размери на екрана.	
                    </li>				
				</ul>	
			</p>     
		</div>
	</div>	
	
	<p class="pt-4 fs-6">
        В този пример, елементът "div" с класово име "container" действа като контейнер за съдържанието. Класът .container в CSS файла дефинира правила за оформление на контейнера. Оформлението на фона, падинга и границата създава визуално отличителен контейнер.       
    </p>
    <p class="codepen" data-height="300" data-theme-id="dark" data-default-tab="html,result" data-slug-hash="bGQXoaz" data-editable="true" data-user="obama-max" style="height: 300px; box-sizing: border-box; display: flex; align-items: center; justify-content: center; border: 2px solid; margin: 1em 0; padding: 1em;">
  <span>See the Pen <a href="https://codepen.io/obama-max/pen/bGQXoaz">
  container example</a> by Darius Popov (<a href="https://codepen.io/obama-max">@obama-max</a>)
  on <a href="https://codepen.io">CodePen</a>.</span>
</p>


