<h2 class="pt-4 fs-4">
		CSS
	</h2>

	<p class="pt-4 fs-6">
        CSS означава "Cascading Style Sheets" (Каскадни стилови листове). Това е език за стилове, използван за описание на визуалната представяне на документ, написан на HTML или XML, като уеб страница. CSS се използва за контролиране на оформлението, форматирането и външния вид на уеб съдържание, като позволява на разработчиците да отделят структурата и съдържанието на уеб страница от нейния дизайн и стилизация.

	</p>

	<p class="pt-4 fs-4">	
        Ето какво прави CSS:
	</p>	

	<div class="row fs-6">
		<div class="col-6">
			<p>
				<ul>
					<li>
                    Стилизация: CSS ви позволява да дефинирате как трябва да изглеждат елементите на уеб страницата. Можете да задавате свойства като цветове, шрифтове, отстъпи, падинг, граници и други.					</li>	

					<li class="mt-2">
                    Оформление: CSS ви помага да контролирате позиционирането и подреждането на елементите на страницата. Можете да контролирате размера, разположението и подравняването на различни елементи.					</li>

					<li class="mt-2"> 
                    Адаптивен дизайн: CSS позволява създаването на адаптивни дизайни, които се приспособяват към различни размери на екрана и устройства. Това е важно за предоставянето на последователен потребителски опит на устройства като настолни компютри, таблети и смартфони.					</li>               
				</ul>	 
			</p>     
		</div>

		<div class="col-6">
			<p>
				<ul>
					<li>
                    Анимации и преходи: CSS поддържа анимации и преходи, които ви позволяват да добавите интерактивни и визуално привлекателни ефекти на елементите на страницата.					</li>

					<li class="mt-2">
                    Типография: CSS ви позволява да контролирате типографията на съдържанието си, включително избора на шрифтове, размери, междуредово разстояние и други.

					</li>
					
					<li class="mt-2"> 
                    Гъвкавост: CSS предлага широка гама от селектори и правила, които ви позволяват да насочвате конкретни елементи, класове, идентификатори или дори конкретни състояния (като плъзгане на мишката над елемент) за прилагане на различни стилове.

					</li>   
				</ul>	
			</p>     
		</div>
	</div>	
	
	<p class="pt-4 fs-6">
    Общо взето, CSS играе важна роля в подобряването на визуалната привлекателност и потребителския опит на уеб съдържанието, като позволява на разработчиците да контролират как елементите се показват на уеб страница	
    </p>

    <p class="codepen" data-height="300" data-theme-id="dark" data-default-tab="html,result" data-slug-hash="MWzNpNR" data-editable="true" data-user="obama-max" style="height: 300px; box-sizing: border-box; display: flex; align-items: center; justify-content: center; border: 2px solid; margin: 1em 0; padding: 1em;">
  <span>See the Pen <a href="https://codepen.io/obama-max/pen/MWzNpNR">
  css</a> by Darius Popov (<a href="https://codepen.io/obama-max">@obama-max</a>)
  on <a href="https://codepen.io">CodePen</a>.</span>
</p>

