<h2 class="pt-4 fs-4">
Инспектирането и отстраняването на грешки в CSS 
</h2>
	

    <p class="pt-4 fs-6">   
        Използване на Инструментите за разработчици на браузъра: <br>
        Съвременните уеб браузъри разполагат с вградени инструменти за програмистите, които ви позволяват да инспектирате и отстранявате грешки на   уеб   страници.
        Отворете инструментите за разработчици, като щракнете с десния бутон върху елемент и изберете "Инспектиране" или като натиснете Ctrl + Shift    + I    (или Cmd + Option + I на Mac) или F12 в повечето браузъри.
    </p>

<p class="col-12 text-center fs-4 my-3">Как да инспектираме?</p>

<div class="col-12 row my-3">
    <div class="col-6">
    <ul class="col-12">
        <li class="pt-4 fs-6 col-12">   
            Разбиране на панела "Инспектор": <br>
            Панелът "Инспектор" предоставя визуално представление на HTML структурата на страницата.
            Можете да видите CSS стиловете, които се прилагат към всеки елемент, включително наследени и заменени стилове.
        </li>

        <li class="pt-4 fs-6 col-12">   
            Инспектиране на елементи: <br>
            Щракнете върху елемент в панела "Инспектор", за да го подчертаете на страницата.
            Можете да навигирате през HTML структурата, като щраквате върху елементи в инспектора.
        </li>

        <li class="pt-4 fs-6 col-12">   
            Преглеждане на изчислените стилове:
            Панелът "Изчислени стилове" показва окончателно изчислените стилове за елемента, взимайки предвид всички приложени стилове, включително     наследени и стилове по подразбиране.
        </li>

        <li class="pt-4 fs-6 col-12">   
            Промяна на стиловете: <br>
            Можете да направите временни промени в CSS стиловете в панела "Стилове" на инспектора.
            Това ви позволява да експериментирате с промени в стиловете преди да ги направите постоянни във вашия код.
        </li>

        <li class="pt-4 fs-6 col-12">   
            Използване на конзолата: <br>
            Панелът "Конзола" в инструментите за разработчици позволява да записвате JavaScript и CSS грешки и да извършвате интерактивно   отстраняване  на   грешки.
            Можете да използвате функцията console.log() за извеждане на съобщения и променливи в конзолата за отстраняване на грешки.
        </li>
        </div>
    
    <div class="col-6">
    <li class="pt-4 fs-6 col-12">   
        Идентифициране и решаване на проблеми: <br>
        Използвайте инспектора, за да идентифицирате проблеми като липсващи или конфликтни CSS правила.
        Изпробвайте промените в панела "Стилове", за да видите техните незабавни ефекти.
        Прегледайте и редактирайте вашия CSS код според нуждите.
    </li>

    <li class="pt-4 fs-6 12">   
        Отстраняване на проблеми със съпротивата: <br>
        Отстраняването на проблеми с макета често включва инспектиране на свойствата на кутията (бокс-модел), позиционирането и размерите.
        Панелът "Инспектор" ви помага да визуализирате макета на елементите на страницата.
    </li>

    <li class="pt-4 fs-6 col-12">   
        Използване на инструменти за валидация на CSS:
        Инструментите за валидация на CSS могат да ви помогнат да идентифицирате синтактични грешки и предупреждения във вашия CSS код.
        Има онлайн инструменти и браузърни добавки за валидация на CSS.
    </li>
    
    <li class="pt-4 fs-6 col-12">   
        Съвместимост с множество браузъри:
        Тествайте уебсайта си в няколко браузъра, за да гарантирате съвместимост с различни браузъри.
        Използвайте инструментите за разработчици, специфични за всеки браузър, за да идентифицирате и отстраните проблеми, свързани с конкретния   браузър.
    </li>
    
    <li class="pt-4 fs-6 col-12">   
            Справяне с проблеми, свързани със специфичността: <br>
            При отстраняването на CSS грешки обърнете внимание на специфичността (колко специфично е CSS правило), за да разберете защо определени      стилове  се прилагат или биват заменени.
            Използвайте раздела "Изчислени" за да видите кои стилове печелят поради специфичност.
        </li>
    </ul>
    </div>
</div>

<div class="mx-auto">
    <video class="" width="500px" height="500px" controls="controls">
        <source src="./assets/videos/inspect.mp4" type="video/mp4" />
    </video>
</div>

<p class="pt-4 fs-6">   
В заключение, инспектирането и отстраняването на грешки в CSS включва използване на инструментите за разработчици на браузъра, инспектиране на HTML структурата, преглед и модификация на CSS стилове, идентифициране на проблеми и направа на необходимите корекции. Обръщайте внимание на специфичността и използвайте наличните инструменти в конзолата за да помогнете на отстраняването на грешки в CSS ефективно.
</p>	

