
<div class="col-md-9 border border-2 fs-4 flex-column border-dark d-flex rounded-4 me-2 pb-5 " tabindex="0">
	<h2 class="pt-4 fs-4">
		Управление на фокуса:
	</h2>
	
	<p class="pt-4 fs-6">	
		Осигуряването на правилни стилове на фокуса и навигационен поток помага на потребителите да разберат текущото си местоположение на страницата и подобрява достъпността с клавиатура.
	</p> 
	
	<p class="pt-4 fs-4">	
		Ето някои ключови аспекти на достъпността чрез фокусиране:
	</p>

	<div class="row fs-6">
		<div class="col-6">
			<p>
				<ul>
					<li>
						Визуално подчертаване на фокуса
					</li>
					<li class="mt-2">
						Чувствителен фокус
					</li>
					<li class="mt-2"> 
						Логичен ред на фокусиране
					</li>
				</ul>	 
			</p>     
		</div>

		<div class="col-6">
			<p>
				<ul>
					<li>
						Индикация за грешки
					</li>
					<li class="mt-2">
						Фокус на съдържание при отваряне на модални прозорци
					</li>
				</ul>	
			</p>     
		</div>
	</div>

	<p class="pt-4 fs-6">	
		Достъпността чрез фокусиране е от голямо значение за предоставяне на удобство и лесна навигация за потребителите с увреждания, които използват клавиатурата за интеракция с уеб сайтовете. При проектирането и разработването на уеб сайтове е важно да се обърне специално внимание на този аспект и да се осигури, че фокусирането и навигацията с клавиатура са оптимизирани за достъпност и удобство.
	</p>
</div>
