<h2 class="pt-4 fs-4">
Решетката в HTML
</h2>

		  

    <p class="pt-4 fs-6">   
        CSS Grid е мощна система за изграждане на мрежови (grid) макети с две измерения, която позволява създаването на сложни мрежови  макети за уеб страници и потребителски интерфейси. Ето обобщение на CSS Grid и неговите ключови концепции:
    </p>	

    <p class="pt-4 fs-5">   
        Обичайните видове навигация на уебсайта включват:
    </p>
   
	<div class="col-12 row">
        <div class="col-6">
		    <ul>
		    	<li class="fs-6">
                    Мрежов контейнер: Елементът-контейнер, който държи всички мрежови елементи. Мрежов контейнер се дефинира с помощта на свойството display: grid;.                
                </li>
    
		    	<li class="mt-2 fs-6">
                    Мрежови елементи: Индивидуалните елементи в мрежовия контейнер, които се подреждат в рамките на мрежата. Мрежовите елементи могат да бъдат HTML елементи като div-ове, span-ове или дори текст.
                </li>
    
		    	<li class="mt-2 fs-6">
                    Мрежови линии: Мрежовите линии разделят мрежата на редове и колони. Те могат да бъдат хоризонтални или вертикални. Мрежовите линии могат да се реферират чрез номерата или имената им.
                </li>
                
                <li class="mt-2 fs-6">
                    Мрежови редове и колони: Хоризонталните и вертикалните раздели на мрежата, дефинирани от мрежовите линии. Можете да зададете броя и размера на редовете и колоните с помощта на свойства като grid-template-rows и grid-template-columns.
                </li>
    
		    	<li class="mt-2 fs-6">
                    Мрежови разстояния: Разстоянието между мрежовите редове и колони. Можете да зададете размера на разстоянието с помощта на свойството grid-gap.
                </li>	
		    </ul>
        </div>

        <div class="col-6">
		    <ul>
		    	<li class="fs-6">
                    Шаблони на мрежови зони: Начин за създаване на именовани мрежови зони, които съответстват на конкретни мрежови елементи. Това позволява по-визуален начин за дефиниране на макета. 
                </li>
    
		    	<li class="mt-2 fs-6">
                    Именуване на мрежови линии: Можете да именувате мрежовите линии, за да улесните референцирането им. 
                </li>
    
		    	<li class="mt-2 fs-6">
                    Позициониране в мрежата: Можете да позиционирате мрежовите елементи в конкретни клетки в мрежата чрез свойства като grid-row и grid-column.
                </li>
                
                <li class="mt-2 fs-6">
                    Поток на мрежови елементи: Направлението, в което мрежовите елементи се подреждат в мрежата. Можете да контролирате това чрез grid-auto-flow.
                </li>
    
		    	<li class="mt-2 fs-6">
                    Адаптивни мрежи: Можете да създадете адаптивни мрежови макети, като използвате медийни заявки (media queries) и променяте мрежовия макет в зависимост от размера на екрана.
                </li>			
		    </ul>
        </div>
	</div>

    <p class="pt-4 fs-5">   
        Навигационни следи (Breadcrumb Trail):
    </p>

    <p class="pt-4 fs-6">   
        Навигационните следи (breadcrumb trail) са помощни инструменти за навигация, които показват йерархичната структура на уебсайта и показват текущото местоположение на потребителя в тази структура. Навигационните следи обикновено се показват хоризонтално най-горе на уеб страницата или под хедъра. Те са особено полезни на уебсайтове с дълбока структура или когато потребителите трябва да се върнат назад в сайта.

        Навигационните следи обикновено се стилизират като поредица от връзки или текст, където всяка връзка представлява ниво в структурата. Потребителите могат да кликнат върху връзка в навигационните следи, за да се навигират бързо към страница на по-високо ниво.    
    </p>	

    
    <p class="pt-4 fs-6">
        Ето пример на grid в HTML и CSS:
    </p>

    <p class="codepen mb-2" data-height="300" data-theme-id="dark" data-default-tab="html,result" data-slug-hash="MWZbgVW" data-editable="true" data-user="obama-max" style="height: 300px; box-sizing: border-box; display: flex; align-items: center; justify-content: center; border: 2px solid; margin: 1em 0; padding: 1em;">
    <span>See the Pen <a href="https://codepen.io/obama-max/pen/MWZbgVW">
    mozzila grid</a> by Darius Popov (<a href="https://codepen.io/obama-max">@obama-max</a>)
    on <a href="https://codepen.io">CodePen</a>.</span>
    </p>
    <script async src="https://cpwebassets.codepen.io/assets/embed/ei.js"></script>

    <p class="pt-4 fs-6">   
        Многоколонният макет в CSS ви позволява да създадете текстови или съдържателни макети, които се разпределят в няколко колони, подобно на макетите във вестници или списания. Ключови свойства включват:
    </p>

    <div class="col-12">
        <ul>
                <li class="fs-6">
                    Брой колони: Определя броя на колоните.
                </li>
    
		    	<li class="mt-2 fs-6">
                    Ширина на колоните: Задава ширината на всяка колона.
                </li>
    
		    	<li class="mt-2 fs-6">
                    Разстояние между колоните: Определя разстоянието между колоните.
                </li>
                
                <li class="mt-2 fs-6">
                    Вертикални линии между колоните: Добавя вертикални линии между колоните.
                </li>
    
		    	<li class="mt-2 fs-6">
                    Разпространение на елементи: Контролира дали елемент трябва да се разпространява върху всички колони.
                </li>
                
                <li class="mt-2 fs-6">
                    Балансиране на съдържанието: Автоматично балансира съдържанието между колоните.
                </li>
    
		    	<li class="mt-2 fs-6">
                    Разрешения за прекъсване: Управлява прекъсванията на страницата и между колоните.
                </li>	
        </ul>
    </div>

    <p class="codepen" data-height="300" data-theme-id="dark" data-default-tab="html,result" data-slug-hash="rNoWBvO" data-editable="true" data-user="obama-max" style="height: 300px; box-sizing: border-box; display: flex; align-items: center; justify-content: center; border: 2px solid; margin: 1em 0; padding: 1em; margin-top: 50px;">
    <span>See the Pen <a href="https://codepen.io/obama-max/pen/rNoWBvO">
    multi-col layout</a> by Darius Popov (<a href="https://codepen.io/obama-max">@obama-max</a>)
    on <a href="https://codepen.io">CodePen</a>.</span>
    </p>
    <script async src="https://cpwebassets.codepen.io/assets/embed/ei.js"></script>
    

<p class="pt-4 fs-6">   
Многоколонните макети са адаптивни и се приспособяват към наличната ширина на контейнера, което ги прави подходящи за различни екрани и устройства. Те са особено полезни за представянето на статии, дълги текстове или съдържание, което се възползва от макет в стил вестник или списание. CSS Grid е широко поддържан от модерните браузъри и предоставя гъвкав и ефективен начин за създаване на сложни макети за уебсайтове и уеб приложения. Той предоставя по-голям контрол върху макета в сравнение с по-старите методи като float и позициониране.
</p>	

