<h2 class="pt-4 fs-4 text-center">
    Изпълнение на скриптовете    
</h2>
	

<p class="pt-4 fs-6">   
   Скрипт тага може да се сложи в &lthead>, може и да се сложи в &ltbody>. Единствената разлика е в това какво искаме да правят самите скриптове. Ако искаме скриптовете да са изпълняват извън сайта, можем да ги сложим в &lthead> тага. Обаче, ако искаме скриптовете да почнат да се изпъляват по някакво време в сайта, то трябва да ги сложим в &ltbody> тага. Ето пример за скрипт, който можем да сложим в &lhhead> и да не е нужно да се изпълнява на по-късен етап в сайта:
</p>

<code-block language="html" label="Script example" controls>
  <textarea>
        <script>
    let d = new Date();
    alert("Today's date is " + d);
</script>
    </textarea>
</code-block>

<p class=" fs-6">   
    Когато страницата зареди на екрана ще се покаже съобщение с днешна дата и час. Този скрипт не е нужено да се активира на по-късен етап в сайта и за това спокойно може да се сложи в &lthead> тага. По-добра практика е скриптовете да се слагат в отделни файлове и е по-чисто да се напише сорса на скрипта, отколкото целия скрипт в &ltscript> тага. Пример за включване на скрипт тагове в HTML документи е:
</p>

<code-block language="html" label="Script file inclusion" controls>
  <textarea>
  <script src = "script.js"> </script> 
  </textarea>
</code-block>


<p class=" fs-6">   
    Доколкото за бодито, там се вкарват скриптове, които искаме да се изпълнят впоследствие в сайта. Повечето примери за такива скриптове са бутони, игри, каклулатори, и др. Прието е да се слагат в дъното на &ltbody> тага. Сега се питате, защо трябва да се съобразяваме с това къде се намира скрипта, дали ще е в &lthead> тага или в дъното на &ltbody> тага. Нека навлезем в подробности.
</p>

<p class="fs-4 mt-3">
    Изпълнение на скриптовете
</p>

<p class="fs-5 mt-2"> 
    Скрипта има две състояния - зареждане и изпълнение. Зареждането е свалянето на самия скрипт от потребителя, а изпълнението е, когато скрипта се задейства.
</p>

<p class="fs-6 mt-2">
    Поредността на изпълнение на скрипта, зависи от неговото място. В &lthead> тага той се изпълнява заедно със зареждането на сайта. Дефакто ще изпълни веднага скрипта, когато зареди. В края на &ltbody> тага, скрипта изчаква HTML-а да зареди и след това той зарежда. Доколкото изпълнението му, извършва се когато бъде повикано действие, което е част от скрипта.
</p>

<p class="fs-6 mt-2">
    Това, което трябва да запомним е, че в &lthead>-а се зарежда със сайта, а в &ltbody>-то изчаква сайта да се зареди и след това той се зарежда.
</p>
 
<p class="fs-6 mt-2">
    Слагането на скриптовете в &ltbody> ни предпазва от това зареждането и изпълнението им да блокират зареждането на HTML елементите от браузъра и също скриптовете ще бъдат кеширани от браузъра и могат да помогнат на по-бързото зареждане на сайта впоследствие.
</p>

<p class="fs-6 mt-2">
    Има начини да се маниполира поредността на зареждане и изпълнение на скриптовете. Модерният и оптимален начин на слагане на скриптове е чрез атрибутите <span class="fw-bold">defer</span> и <span class="fw-bold">async</span>. Модерните браузъри вече ги поддържат и не е проблем да се използват.
</p>

<p class="fs-5 mt-2">
    Defer
</p>

<p class="fs-6">
    Когато <span class="fw-bold">defer</span> атрубута бъде изполван, кара скрипта да зарежда паралелно със страницата и се изпълнява, когато е необходимо впоследствие.
</p>

<p class="fs-5 mt-2">
    Async
</p>

<p class="fs-6">
    А, когато <span class="fw-bold">async</span> атрубута бъде използван, той се зарежда пак паралелно със сайта, но и се изпълнява в същото време, когато зареди.
</p>

<p class="fs-5 mt-2">
    Ето и пример за използването на атрибутите:
</p>

<code-block language="html" label="Defer and Async application" controls>
  <textarea>
  <script src = "script.js" defer> </script> 
<script src = "script.js" async> </script> 
  </textarea>
</code-block>

<p class="fs-5">
    Ето и визуализация, за да си представите по-добре как се случват зарежданията и изпълненията:
</p>

<img src="./assets/images/async-defer (1).jpg" style="max-width: 950px; margin: auto" alt="#">

<p class="fs-6 mt-2">
    Със зелено е отбелязано зареждането на HTML документа, със синьо е зареждането, а с червено е изпълнението. Както виждате по визуализацията, има голяма разлика от това къде поставиш скриптовете и как ще им кажеш да се изпълнят. Единственото невизуализирано нещо е как оперират скриптовете, когато са сложени в края на &ltbody> тага. Представете си, че синията и червената линия започват след зелената, дефакто изчакват HTML документада зареди и след това се изпълняват те.
</p>
<p class="fs-6 mt-2">
    За заключение, това е горе-долу нужното което трябва да се спомене за зареждането и изпълнението на скриптовете в HTML. Не малка роля има позиционирането, но според мен трябва да му се обръща по-голямо внимание само при по-големи и задълбочени сайтове и проекти. В повечето случаи, ако поставиш скриптовете в края на &ltbody> тага, няма да имаш проблеми.
</p>