	<h2 class="pt-4 fs-4 ">
		Достъпност с клавиатура:
	</h2>
	
	<p class="pt-4 fs-6">	
		Всички функционалности и интерактивни елементи на уеб сайта трябва да бъдат достъпни и използваеми с клавиатура. Потребителите с двигателни увреждания могат да разчитат на клавиатурата или други устройства за въвеждане, вместо на мишка.
	</p>   
	
	<p class="pt-4">	
		Ето някои ключови аспекти на достъпността чрез клавиатура:
	</p>

	<div class="row fs-6">
		<div class="col-6">
			<p>
				<ul>
					<li>
						Фокусиране и навигация
					</li>
					<li class="mt-2">
						Използване на клавишни превключвания
					</li>
					<li class="mt-2"> 
						Състояние на фокуса
					</li>
				</ul>	 
			</p>     
		</div>

		<div class="col-6">
			<p>
				<ul>
					<li>
						Използване на "<a href="https://developer.mozilla.org/en-US/docs/Web/HTML/Global_attributes/tabindex">tabindex</a>"
					</li>
					<li class="mt-2">
						Разумно разстояние между елементите
					</li>
					<li class="mt-2"> 
						Тестване с клавиатура
					</li>
				</ul>	
			</p>     
		</div>
	</div>

	<p class="pt-4 fs-6">	
		Предоставянето на достъпност чрез клавиатура помага на потребителите с увреждания да използват уеб сайтовете си с равни възможности. При проектирането и разработването на уеб сайтове е важно да се обърне специално внимание на този аспект и да се предоставят удобни и лесни за използване възможности за навигация и интеракция с клавиатура.
	</p>
