<h2 class="pt-4 fs-4">
		Lighthouse
	</h2>

	<p class="pt-4 fs-6">
       

    Функцията "Lighthouse" е неразделна част от съвременното развитие на уебсайтове и SEO практики. Това е мощен инструмент с отворен код, разработен от Google, който помага на програмисти, уебмастъри и специалисти по SEO да оценят и подобрят качеството, производителността, достъпността и общото потребителско изживяване на уебсайтове. Lighthouse може да се използва като разширение за браузъра в Google Chrome или като инструмент от командния ред.
	</p>

	<p class="pt-4 fs-4">	
		Ето някои ключови аспекти за Lighthouse:
	</p>	

	<div class="row fs-6">
		<div class="col-6">
			<p>
				<ul>
					<li>
                        Аудит на Уебсай (PWA)
					</li>	
					<li class="mt-2">
                        Оценка на Скоростта на Зареждане
					</li>	
					<li class="mt-2"> 
                        Оценка за Мобилна Пригодност
					</li>
                    <li class="mt-2"> 
                        Оценка на Достъпността
					</li>                                     
				</ul>	 
			</p>     
		</div>

		<div class="col-6">
			<p>
				<ul>
					<li>
                        Непрекъсната Оптимизация
					</li>	
					<li class="mt-2">
                        Отворен Код и Поддръжка от Общността и подробни доклади
					</li>
                    <li class="mt-2"> 
                        Интеграция с Други Инструменти
					</li> 
				</ul>	
			</p>     
		</div>
	</div>	
	
	<p class="pt-4 fs-6">
    За резюме, функцията Lighthouse е ценен инструмент за оптимизация на уебсайтове за търсачки и гарантиране на изключително потребителско изживяване. Като се занимават с различните аспекти, оценявани от Lighthouse, уебмастърите и специалистите по SEO могат да подобрят производителността, достъпността и видимостта на уебсайтовете си в резултатите от търсачките.    <img style="height: 412.5px; width: 1465px;" src="./assets/images/SEO3.PNG" alt="image showing scores from lighthouse">
</p>


