<h2 class="pt-4 fs-4">
Списък в HTML
</h2>

		

    <p class="pt-4 fs-6">   

    Списък в HTML е начин за организиране и показване на колекция от свързани елементи или информация в структуриран формат. Списъците се използват обикновено, за да представят информация по четим и организиран начин. В HTML има три основни вида списъци:

    </p>

   

    <p class="pt-4 fs-6">   

    Ключови атрибути на елемента &lt;form> включват:    

    </p>	


   
	<div class="col-12">
		<ul>
			<li class="fs-6">
                Неномерирани списъци (&lt;ul>): Неномерираният списък се използва, когато елементите в списъка нямат конкретна последователност или ред, и искате да ги покажете с точки или други маркери. Всеки елемент в неномерирания списък обикновено предшества точка. Този вид списък е подходящ за представяне на колекция от елементи без определен ред.
            </li>
			
			<li class="mt-2 fs-6">
                Списък с дефиниции (&lt;dl>): Списъкът с дефиниции се използва, за да дефинира термини и съответните им описания. Всеки термин е затворен в таг &lt;dt> (дефиниран термин), а всяко описание е затворено в таг &lt;dd> (дефинирано описание). Списъците с дефиниции често се използват за глосари, речници или обяснения.
			</li>
		</ul>
	</div>

    <p class="pt-4 fs-5">
     Пример за списък в ХТМЛ и стил сложен към него:    
    </p>

    
    <p class="codepen" data-height="300" data-theme-id="dark" data-default-tab="html,result" data-slug-hash="poqEZeE" data-editable="true" data-user="obama-max" style="height: 300px; box-sizing: border-box; display: flex; align-items: center; justify-content: center; border: 2px solid; margin: 1em 0; padding: 1em;">
    <span>See the Pen <a href="https://codepen.io/obama-max/pen/poqEZeE">
    list</a> by Darius Popov (<a href="https://codepen.io/obama-max">@obama-max</a>)
    on <a href="https://codepen.io">CodePen</a>.</span>
    </p>
    <script async src="https://cpwebassets.codepen.io/assets/embed/ei.js"></script>

    <div class="col-12">
        <ul>
            <p class="fs-6"> 
                Номериран списък (&lt;ol>):
            </p>

            <li class="fs-6 mt-2">
                list-style-type: decimal;: Задава стил на номерация на номерирания списък с десетични числа (1, 2, 3).
            </li>

            <li class="fs-6 mt-2">
                color: #007BFF;: Задава цвят на текста на елементите на номерирания списък в синьо.
            </li>

            <li class="fs-6 mt-2">
                font-weight: bold;: Прави числата (маркерите на списъка) удебелени.   
            </li>

            <p class="fs-6"> 
                Неномериран списък (&lt;ul>):
            </p>

            <li class="fs-6 mt-2">
                list-style-type: square;: Задава стил на маркерите на неномерирания списък като квадрати.
            </li>

            <li class="fs-6 mt-2">
                color: #333;: Задава цвят на текста на елементите на неномерирания списък в тъмно сиво.
            </li>

            <p class="fs-6"> 
                Списък с дефиниции (&lt;dl>):
            </p>

            <li class="fs-6 mt-2">
                color: #FF5733;: Задава цвят на текста на елементите на списък с дефиниции в червено.
            </li>

            <li class="fs-6 mt-2">
                dt { font-weight: bold; }: Прави термините (елементите dt) в списъка с дефиниции удебелени.
            </li>

            <li class="fs-6 mt-2">
                dd { margin-left: 20px; }: Добавя ляво отместване на описанията (елементите dd) за вдлъбване.
            </li>
        </ul>
    </div>

<p class="pt-4 fs-6">   
Списъците са универсални и важни елементи в HTML за структурирането на съдържание и подобряването на неговата четимост. Те предоставят логичен начин за организиране на информацията, като я правят по-лесна за разбиране и навигиране на уеб страниците. В зависимост от вида информация, която искате да представите и желания визуален стил, можете да изберете между номерирани, неномерирани или списъци с дефиниции.
</p>	

