<h2 class="pt-4 fs-4">
Margin и Padding 
</h2>

	<p class="pt-4 fs-6">
   
    Margin и Padding ни помагат и дават способността да правим промени към нашите елементи и тяхното положение. Margin се използва за промяната на разстоянието на елемента спрямо други елементи в сайта. Padding се използва за промяната на разстоянието на елемента спрямо себе си и неговата граница.	</p>

    <img src="./assets/images/CSS1.png" style="height: 300px; width: 600px;" alt="snimka lul">

	<p class="pt-4 fs-4">	
        Маргини:
    </p>	

	<div class="row fs-6">
		<div class="col-6">
			<p>
				<ul>
					<li>
                    Маргините са пространството извън границата на елемента. Те създават разстояние между елемента и неговите съседни елементи.
                    </li>	

					<li class="mt-2">
                    Можете да зададете маргини за всички страни (горе, дясно, долу, ляво) индивидуално или в съкратен формат.
                    </li>

                    <li class="mt-2">
                    Отрицателни маргини могат да се използват, за да се прекриват елементи или да ги приближат.
                   </li>

                   <li class="mt-2">
                   Стойността auto може да се използва, за да центрирате хоризонтално блокови елементи в техния родителски контейнер.
                   </li>		
                </ul>	 
			</p>     
		</div>

		<div class="col-6">
            <p class="fs-4">	
                Падинги:
             </p>
				<ul>
					<li>
                    Падингите са пространството вътре в границата на елемента. Те създават разстояние между съдържанието на елемента и неговата граница.
                    </li>

					<li class="mt-2">
                    Можете да зададете падинги за всички страни индивидуално или в съкратен формат.
                    </li>

                    <li class="mt-2">
                    Падингът влияе на размера на областта за съдържание на елемента.
                    </li>				
                </ul>	
			</p>     
		</div>
	</div>
    
    <p class="pt-4 fs-4">	
                Примери:
    </p>

	<p class="codepen" data-height="300" data-theme-id="dark" data-default-tab="html,result" data-slug-hash="eYQqxEY" data-editable="true" data-user="obama-max" style="height: 300px; box-sizing: border-box; display: flex; align-items: center; justify-content: center; border: 2px solid; margin: 1em 0; padding: 1em;">
    <span>See the Pen <a href="https://codepen.io/obama-max/pen/eYQqxEY">
    Untitled</a> by Darius Popov (<a href="https://codepen.io/obama-max">@obama-max</a>)
    on <a href="https://codepen.io">CodePen</a>.</span>
    </p>

    <p class="pt-4 fs-6">
    Помнете, че маргините и падингите могат да влияят на оформлението и разстоянието на елементите в рамките на контейнер. Общата ширина на елемент се изчислява като добавите неговата ширина, падинга и границата. Подобно на това, общата височина включва височината, падинга и границата.

Като използвате маргини и падинги ефективно, можете да управлявате бялото пространство около и вътре в елементите, постигайки желаното визуално разстояние и оформление за вашата уеб страница
    </p>