<h2 class="pt-4 fs-4">
Навигация и Навигационни следи  в HTML
</h2>

		

    <p class="pt-4 fs-5">   
        Навигация:
    </p>

   

    <p class="pt-4 fs-6">   
    Навигацията се отнася до менютата и връзките, които позволяват на потребителите да се движат между различни страници или секции на уебсайта. Ефективната навигация подобрява потребителския опит, като прави лесно за посетителите да намерят информация и да достъпват различни части на сайта. В HTML навигационните менюта обикновено се създават с помощта на списъци (&lt;ul> и &lt;li>) и връзки (&lt;a>).
    </p>	

    <p class="pt-4 fs-5">   
        Обичайните видове навигация на уебсайта включват:
    </p>
   
	<div class="col-12">
		<ul>
			<li class="fs-6">
                Главна навигация: Основното меню обикновено се поставя най-горе на уеб страницата или на изразително място и съдържа връзки към ключови секции на сайта.
            </li>
			
			<li class="mt-2 fs-6">
                Вторична навигация: Допълнителни менюта или връзки, предоставящи достъп до конкретни секции, категории или функции.
			</li>
			
			<li class="mt-2 fs-6">
                Навигация в долния колонтитул: Връзки за навигация, поставени в долния колонтитул на уеб страницата, често с връзки към политики за поверителност, условия за ползване, контактна информация и др.
            </li>			
		</ul>
	</div>

    <p class="pt-4 fs-5">   
        Навигационни следи (Breadcrumb Trail):
    </p>

    <p class="pt-4 fs-6">   
        Навигационните следи (breadcrumb trail) са помощни инструменти за навигация, които показват йерархичната структура на уебсайта и показват текущото местоположение на потребителя в тази структура. Навигационните следи обикновено се показват хоризонтално най-горе на уеб страницата или под хедъра. Те са особено полезни на уебсайтове с дълбока структура или когато потребителите трябва да се върнат назад в сайта.

        Навигационните следи обикновено се стилизират като поредица от връзки или текст, където всяка връзка представлява ниво в структурата. Потребителите могат да кликнат върху връзка в навигационните следи, за да се навигират бързо към страница на по-високо ниво.    
    </p>	

    
    <p class="pt-4 fs-6">
        Ето пример на стилизирано навигационно меню и навигационни следи в HTML и CSS:
    </p>

    
    <p class="codepen" data-height="300" data-theme-id="dark" data-default-tab="html,result" data-slug-hash="GRPjBxV" data-editable="true" data-user="obama-max" style="height: 300px; box-sizing: border-box; display: flex; align-items: center; justify-content: center; border: 2px solid; margin: 1em 0; padding: 1em;">
    <span>See the Pen <a href="https://codepen.io/obama-max/pen/GRPjBxV">
    Untitled</a> by Darius Popov (<a href="https://codepen.io/obama-max">@obama-max</a>)
    on <a href="https://codepen.io">CodePen</a>.</span>
    </p>
    <script async src="https://cpwebassets.codepen.io/assets/embed/ei.js"></script>

    <p class="pt-4 fs-6">
        Ето пример на стилизирано навигационно меню и навигационни следи в HTML и CSS:
    </p>

    <div class="col-12">
        <ul>

            <li class="fs-6 mt-2">
                Навигационното меню (ul.nav-menu) е стилизирано със син фон и бели символи. Връзките са удебелени и нямат подчертаване.
            </li>

            <li class="fs-6 mt-2">
                Навигационните следи са стилизирани със светло сив фон и поредица от връзки или текст. Текущата страница е показана в удебелен текст.
            </li>
        </ul>
    </div>

<p class="pt-4 fs-6">   
Можете да персонализирате стиловете и съдържанието на навигационното меню и навигационните следи, за да отговарят на дизайна и структурата на вашия уебсайт. Тези елементи са от съществено значение за подобряване на потребителската навигация и разбиране на структурата на уебсайта ви.
</p>	

