
	<h1 class="pt-4 fs-3 d-flex justify-content-center" tabindex="0">
		Изпълнимостта в достъпността:
	</h1>
	
	<p class="pt-4 fs-6" tabindex="0">	
		Уеб съдържанието трябва да е лесно достъпно и интерактивно, позволявайки на потребителите да извършват различни действия. Това включва достъпност с клавиатура, предоставяне на достатъчно време за четене, взаимодействие със съдържанието и избягване на съдържание, което може да предизвика епилептични припадъци или физически дискомфорт.
	</p> 

	<p class="fs-6" tabindex="0">	
		Изпълнимата достъпност играе важна роля за осигуряването на функционалността и навигационната лекота на уеб сайтовете за всички потребители. При проектирането и разработването на уеб сайтове е важно да се обърне внимание на този аспект и да се предоставят решения, които улесняват и подпомагат потребителите с различни увреждания при използването на сайта.
	</p> 

	
	<h2 class="fs-4" tabindex="0">
		Функционалността е достъпна от клавиатурата
	</h2>

	<p class="pt-4 fs-6" tabindex="0">
		Много хора не използват мишката и разчитат на клавиатурата, за да взаимодействат с уеб пространството. Това изисква, всички функционалности, включително формулярите, входовете за достъп и другите компоненти на потребителския интерфейс, да бъдат лестно достъпни чрез клавиатурата.
	</p>

	<p class="fs-5" tabindex="0">
		Достъпността чрез клавиатура включва:
	</p>

	<div class="row">
		<div class="col-12">
			<ul tabindex="0">
				<li class="fs-6" tabindex="0">
					Всички функционалности, които са достъпни чрез мишка, да са също достъпни чрез клавиатура
				</li>

				<li class="mt-2 fs-6" tabindex="0">
					Фокусът на клавиатурата не изчезва в нито една част от съдържанието
				</li>

				<li class="mt-2 fs-6" tabindex="0">
					Уеб браузърите, авторските инструменти и другите инструменти предоставят поддръжка чрез клавиатурата
				</li>
			</ul>
		</div>
	</div>

	<p class="fs-6" tabindex="0">
		Изпълнението на това изискване помага на потребителите на клавиатури, включително хора, които използват алтернативни клавиатури, като клавиатури с ергономични подредби, екранирани клавиатури или превключващи устройства. То също помага на хора, които използват гласово разпознаване (гласов вход) за работа с уебсайтове и диктуване на текст чрез клавиатурния интерфейс.
	</p>


	<h2 class="fs-4" tabindex="0">
		Потребителите трябва имат достатъчно време да прочетат и използват съдържанието
	</h2>

	<p class="pt-4 fs-6" tabindex="0">
		Някои хора се нуждаят от повече време от други, за да прочетат и използват съдържанието. Например, някои хора им отнема повече време да пишат текст, разбират инструкции, работят с контроли или други задачи на уебсайт.
	</p>

	<p class="fs-5" tabindex="0">
		Примери за осигуряване на достатъчно време включват предоставяне на механизми за:
	</p>

	<div class="row">
		<div class="col-12">
			<ul tabindex="0">
				<li class="fs-6" tabindex="0">
					Спиране, удължаване или коригиране на времеви ограничения, освен ако не е необходимо
				</li>

				<li class="mt-2 fs-6" tabindex="0">
					Паузиране, спиране или скриване на движещо се, мигащо или превъртящо се съдържание
				</li>

				<li class="mt-2 fs-6" tabindex="0">
					Отлагане или подтискиване на прекъсвания, освен ако не е необходимо
				</li>

				<li class="mt-2 fs-6" tabindex="0">
					Повторна автентикация, когато сесията изтече, без да се губят данни
				</li>
			</ul>
		</div>
	</div>

	<h2 class="fs-4" tabindex="0">
		Съдържанието да не предизвиква епилептични припадъци и физически реакции
	</h2>

	<p class="pt-4 fs-6" tabindex="0">
		Съдържание, което мига с определена честота или шаблони, може да предизвика фоточувствителни реакции, включително епилептични припадъци. Желателно е изцяло да се избягва използването на мигащо съдържание или да се използва по такъв начин, че да не предизвиква известни рискове. Също така, анимациите и движещото се съдържание може да предизвика дискомфорт и физически реакции.
	</p>

	<p class="fs-5" tabindex="0">
		Примери за избягване на предизвикване на епилептични припадъци и физически реакции:
	</p>

	<div class="row">
		<div class="col-12">
			<ul tabindex="0">
				<li class="fs-6" tabindex="0">
					Не включвайте съдържание, което мига с определени честоти и шаблони
				</li>

				<li class="mt-2 fs-6" tabindex="0">
					Предупреждавайте потребителите, преди да се предостави мигащо съдържание, и предоставете алтернативи
				</li>

				<li class="mt-2 fs-6" tabindex="0">
					Предоставете механизми за изключване на анимациите, освен ако те са съществени
				</li>
			</ul>
		</div>
	</div>

	<h2 class="fs-4" tabindex="0">
		Потребителите трабва да могат лесно да навигират, намират съдържание и определят къде се намират
	</h2>

	<p class="fs-5" tabindex="0">
		Добре организираното съдържание помага на потребителите да се ориентират и да навигират ефективно. Такова съдържание включва:
	</p>

	<div class="row">
		<div class="col-12">
			<ul tabindex="0">
				<li class="fs-6" tabindex="0">
					Страниците да имат ясни заглавия и да са организирани с помощта на описания
				</li>

				<li class="mt-2 fs-6" tabindex="0">
					Съществуват повече от един начин да се намерят подходящи страници в рамките на набор от уеб страниците
				</li>

				<li class="mt-2 fs-6" tabindex="0">
					Потребителите да са информирани за тяхната текуща локация от набор от свързани страници
				</li>

				<li class="mt-2 fs-6" tabindex="0">
					Съществуват начини за пропускане на блокове съдържание, които се повтарят на множество страници
				</li>

				<li class="mt-2 fs-6" tabindex="0">
					Фокусът на клавиатурата е видим, и редът на фокусиране следва смислена последователност
				</li>

				<li class="mt-2 fs-6" tabindex="0">
					Целта на връзката е очевидна, предпочитано връзката да се разглежда самостоятелно
				</li>
			</ul>
		</div>
	</div>

	<p class="fs-6" tabindex="0">
		Изпълнението на това изискване помага на хората да навигират из уеб страници по различни начини, в зависимост от техните специфични нужди и предпочитания. Например, докато някои хора разчитат на йерархични навигационни структури, като менюта, за да намерят конкретни уеб страници, други разчитат на функции за търсене на уебсайтове. Някои хора може да виждат съдържанието, докато други го чуват или го виждат и чуват едновременно. Някои хора могат да използват съдържанието само с мишка или клавиатура, докато други използват и двете.
	</p>

	<h2 class="fs-4" tabindex="0">
		Потребителите трябва да могат да използват различни начини на въвеждане освен клавиатурата
	</h2>

	<p class="pt-4 fs-6" tabindex="0">
		Начини на въвеждане, различен от клавиатурата като докосване на touchscreen, разпознаване на глас (гласово въвеждане) и жестове, правят съдържанието по-лесно за използване на много хора. Все пак, не всеки може да използва всички от тези начини на въвеждане и на същото ниво. Определени дизайнерски аспекти максимизират ползата от тези начини на въвеждане.
	</p>

	<p class="fs-5" tabindex="0">
		Това включва:
	</p>

	<div class="row">
		<div class="col-12">
			<ul tabindex="0">
				<li class="fs-6" tabindex="0">
					Жестове, които изискват ловкост или фини движения, имат алтернативи, които не изискват висока ловкост
				</li>

				<li class="mt-2 fs-6" tabindex="0">
					Компонентите са изградени така, че да се избягва случайна активация, например като се предостави функционалност за отмяна
				</li>

				<li class="mt-2 fs-6" tabindex="0">
					Етикетите, представени на потребителите, да съответстват на имената на обекти в кода, за да се поддържа активация чрез глас
				</li>

				<li class="mt-2 fs-6" tabindex="0">
					Функционалността, която се активира чрез движение, също може да се активира чрез компоненти на потребителския интерфейс
				</li>

				<li class="mt-2 fs-6" tabindex="0">
					Бутоните, връзките и другите активни компоненти са достатъчно големи, за да ги направят по-лесно за активиране с докосване
				</li>
			</ul>
		</div>
	</div>

	<p class="fs-6" tabindex="0">
		Изпълнението на това изискване прави съдържанието по-лесно за използване от много хора с разнообразни способности, като използват разнообразни устройства. Това включва съдържание, използвано на мобилни телефони, таблети и самообслужващи терминали, като автомати за продажба на билети.
	</p>

	<p class="fs-6" tabindex="0">
		Повече информация за точните правила според принципите <a href="https://www.w3.org/WAI/standards-guidelines/wcag/">WCAG</a>, <a href="https://www.w3.org/WAI/standards-guidelines/atag/">ATAG</a>, <a href="https://www.w3.org/WAI/standards-guidelines/uaag/">UAAG</a>; може да се намери в сайта на <a href="https://www.w3.org/WAI/fundamentals/accessibility-principles/#operable">W3C Operable</a> частта. Когато отворите подкатегорията "accessibility requirements" изизат всички правила според принципите за достъпност.
	</p>
	
 




