
	<h2 class="pt-4 fs-4">
		Изпълнимост:
	</h2>
	
	<p class="pt-4 fs-6">	
		Уеб съдържанието трябва да е навигируемо и интерактивно, позволявайки на потребителите да извършват различни действия. Това включва достъпност с клавиатура, предоставяне на достатъчно време за четене и взаимодействие със съдържанието и избягване на съдържание, което може да предизвика епилептични припадъци или физическо дискомфорт.
	</p> 

	<p class="pt-4 fs-4">	
		Ето някои ключови аспекти на изпълнимата достъпност:
	</p>
	
	<div class="row fs-6">
		<div class="col-6">
			<p>
				<ul>
					<li>
						Достъпност с клавиатура
					</li>
					<li class="mt-2">
						Задържане на фокуса
					</li>
					<li class="mt-2"> 
						Избягване на времеви ограничения
					</li>
				</ul>	 
			</p>     
		</div>

		<div class="col-6">
			<p>
				<ul>
					<li>
						Ясни инструкции и съобщения за грешка
					</li>
					<li class="mt-2">
						Избягване на автоматично възпроизвеждане
					</li>
				</ul>	
			</p>     
		</div>
	</div>

	<p class="pt-4 fs-6">	
		Изпълнимата достъпност играе важна роля за осигуряването на функционалността и навигационната лекота на уеб сайтовете за всички потребители. При проектирането и разработването на уеб сайтове е важно да се обърне внимание на този аспект и да се предоставят решения, които улесняват и подпомагат потребителите с различни увреждания при използването на сайта.
	</p> 
