<h2 class="pt-4 fs-4">
Преплването в CSS 
</h2>
	

    <p class="pt-4 fs-6">   
    Препълването (overflow) в CSS представлява ситуация, при която съдържанието на един HTML елемент (например, текст, изображения или други елементи) излиза извън границите на своя родителски контейнер. Това може да стане, когато съдържанието е по-голямо от размерите на контейнера или когато дизайнът не е коректно настроен за съдържането.

    Препълването може да се случи в хоризонтална или вертикална посока, в зависимост от измерението на контейнера и съдържанието
    </p>

<p class="col-12 text-center fs-4 my-3">Как да се справим в него?</p>

<div class="col-12 row my-3">
    <div class="col-6">
    <ul class="col-12">
        <li class="pt-4 fs-6 col-12">   
            Свойство Overflow (Препълване): <br>
            Свойството overflow се използва за контролиране на поведението, когато съдържанието надхвърля границите на своя     контейнер.
            То има няколко стойности, включително visible (видимо), hidden (скрито), scroll (със скролбар) и auto (автоматично).
        </li>

        <li class="pt-4 fs-6 col-12">   
            Видимо Препълване (По Подразбиране): <br>
            Стойността по подразбиране е visible, където препълващото съдържание е видимо извън границите на своя контейнер.
        </li>

        <li class="pt-4 fs-6 col-12">   
            Скрито Препълване: <br>
            С overflow: hidden; препълващото съдържание се изрязва и не е видимо.
        </li>

        <li class="pt-4 fs-6 col-12">   
            Със Скролбар Препълване: <br>
            overflow: scroll; добавя скролбари към контейнера, позволявайки на потребителите да преглеждат съдържанието, ако то препълва.
        </li>

        <li class="pt-4 fs-6 col-12">   
            Автоматично Препълване: <br>
            overflow: auto; добавя скролбари само когато съдържанието препълва, което прави тяхната поява динамична.
        </li>

        <li class="pt-4 fs-6 col-12">   
            Overflow-x и Overflow-y: <br>
            Можете да контролирате хоризонталната и вертикалната препълва независимо чрез свойствата overflow-x и overflow-y.
        </li>
        
        </div>
    
    <div class="col-6">
    <li class="pt-4 fs-6 col-12">   
        Препълване във Flex и Grid Контейнери: <br>
        Flex и grid контейнерите обработват препълването по различен начин, и можете да използвате свойства като overflow и min-width за да контролирате поведението им.
    </li>

    <li class="pt-4 fs-6 12">   
        Препълване и Размери на Съдържание: <br>
        Внимавайте как препълващото съдържание може да повлияе на размерите на родителски и деца елементи.
    </li>

    <li class="pt-4 fs-6 col-12">   
        Препълване и Позициониране: <br>
        Препълващото съдържание може да влияе на позиционирането на съседни елементи.
    </li>
    
    <li class="pt-4 fs-6 col-12">   
        Работа с Препълване в Уеб Дизайна: <br>
        Планирайте дизайна си така, че да се справяте грациозно с възможното препълване.
        Използвайте медийни запитвания и адаптивен дизайн, за да се справите с препълването на различни устройства.
    </li>
    
    <li class="pt-4 fs-6 col-12">   
        Справяне с Препълване в Текст и Изображения: <br>
        Използвайте CSS свойства като white-space и text-overflow, за да контролирате препълването на текст.
        Задайте max-width или използвайте адаптивни изображения, за да предотвратите препълването на изображения.
    </li>

    <li class="pt-4 fs-6 col-12">   
        Справяне с Препълване в Контейнери: <br>
        Използвайте подходящи стойности за свойството overflow в зависимост от изискванията на дизайна ви.
    </li>
    </ul>
    </div>
</div>

<p class="codepen" data-height="300" data-theme-id="dark" data-default-tab="html,result" data-slug-hash="bGOWjVL" data-editable="true" data-user="obama-max" style="height: 300px; box-sizing: border-box; display: flex; align-items: center; justify-content: center; border: 2px solid; margin: 1em 0; padding: 1em;">
  <span>See the Pen <a href="https://codepen.io/obama-max/pen/bGOWjVL">
  Untitled</a> by Darius Popov (<a href="https://codepen.io/obama-max">@obama-max</a>)
  on <a href="https://codepen.io">CodePen</a>.</span>
</p>
<script async src="https://cpwebassets.codepen.io/assets/embed/ei.js"></script>

<p class="pt-4 fs-6">   
Заключително, свойството overflow в CSS е от съществено значение за контролиране на поведението на съдържанието, когато то надхвърля границите на своя контейнер. Правилното управление на препълването е ключово за създаването на визуално привлекателни и потребителски приятни уеб дизайни. Разбирането на различните стойности на свойството overflow и техните ефекти е важно за ефективната уеб разработка.
</p>	

