
	<h1 class="pt-4 fs-3 d-flex justify-content-center" tabindex="0">
		Възприемливостта в достъпността:
	</h1>
	
	<p class="pt-4 fs-6" tabindex="0">	
		Информацията и елементите на потребителския интерфейс трябва да се представят по начини, които потребителите могат да възприемат, независимо от техните сетивни способности. Това включва предоставяне на алтернативен текст за изображения, заглавия за видео и ясен цветов контраст за текста.
	</p>  

	<p class="fs-6" tabindex="0">	
		Възприемливата достъпност играе ключова роля в осигуряването на равен достъп до информацията и услугите в интернет пространството за всички потребители, независимо от техните специфични нужди или увреждания. При проектирането и разработването на уеб сайтове е от съществено значение да се има предвид този аспект и да се предоставят адекватни решения за постигане на възприемлива достъпност.
	</p>

	<h2 class="pt-4 fs-4" tabindex="0">
		Алтернативен текст за съдържание без текст:
	</h2>

	<p class="pt-4 fs-5" tabindex="0">
		Текстовите алтернативи са еквиваленти за не-текстово съдържание. Примери включват:
	</p>

	<div class="row">
		<div class="col-12">
			<ul tabindex="0">
				<li class="fs-6" tabindex="0">
					Кратки описания на изображения, включително икони, бутони и графики
				</li>
				
				<li class="mt-2 fs-6" tabindex="0">
					Описание на данните, представени на диаграми, схеми и илюстрации
				</li>

				<li class="mt-2 fs-6" tabindex="0">
					Кратки описания на не-текстово съдържание, като аудио и видео файлове
				</li>
				
				<li class="mt-2 fs-6" tabindex="0">
					Етикети за контроли на формуляри, входове и други компоненти на потребителския интерфейс
				</li>
			</ul>
		</div>
	</div>

	
	<p class="fs-6" tabindex="0">
		Текстовите алтернативи предават целта на изображение или функция, за да осигурят ясно описано потребителско изживяване. Например, подходящ текстов алтернатив за бутон за търсене би бил "търсене", а не "button img/svg".
	</p>

	<p class="fs-6" tabindex="0">
		Текстовите алтернативи могат да бъдат представени по различни начини. Например, те могат да бъдат прочетени на глас за хора, които не могат да видят екрана, и за хора с затруднения в четенето, да бъдат уголемени до индивидуални размери на текста или да бъдат показани на брайлови устройства. Текстовите алтернативи служат като етикети за контроли и функционалности, за да помогнат на навигацията с клавиатура и навигацията с разпознаване на глас (гласов вход). Те също така действат като етикети, за да идентифицират аудио, видео и файлове в други формати, както и приложения, които са вградени като част от уеб сайт.
	</p>


	<h2 class="pt-4 fs-4" tabindex="0">Субтитри и други алтернативи за мултимедийни елементи</h2>

	<p class="pt-4 fs-5" tabindex="0">Хората, които нямат слух или не могат да гледат видео, се нуждаят от алтернативи. Примери включват:</p>


	<div class="row">
		<div class="col-12">
			<ul tabindex="0">
				<li class=" fs-6" tabindex="0">
					Текстови транскрипции и субтитри за аудио съдържание, като записи на радио интервю
				</li>

				<li class="mt-2 fs-6" tabindex="0">
					Аудио описания, които служат за описание на важни визуални детайли във видео
				</li>

				<li class="mt-2 fs-6" tabindex="0">
					Интерпретация на жестов език за аудио съдържание, включително съответните слухови преживявания
				</li>
			</ul>
		</div>
	</div>

	<p class="fs-6" tabindex="0">
		Добре написаните текстови транскрипции, съдържащи правилната последователност на всяка слухова или визуална информация, предоставят основно ниво на достъпност и облекчават производството на субтитри и аудио описания.
	</p>

	<h2 class="pt-4 fs-4" tabindex="0">
		Съдържанието може да бъде представено по различни начини
	</h2>

	<p class="pt-4 fs-5" tabindex="0">
		За да могат потребителите да променят представянето на съдържанието, е необходимо:
	</p>

	<div class="row">
		<div class="col-12">
			<ul tabindex="0">
				<li class=" fs-6" tabindex="0">
					Заглавията, списъците, таблиците, полетата за въвеждане и структурите на съдържанието да са маркирани правилно
				</li>

				<li  class="mt-2 fs-6" tabindex="0">
					Последователностите на информацията или инструкциите да са независими от всякакво представяне
				</li>

				<li class="mt-2 fs-6" tabindex="0">
					Браузърите и помощните технологии да предоставят настройки за персонализиране на представянето
				</li>
			</ul>
		</div>
	</div>


	<p class="fs-6" tabindex="0">
		Спазването на това изискване позволява на съдържанието да бъде правилно прочетено на глас, уголемено или адаптирано, за да отговаря на нуждите и предпочитанията на различни хора. Например, то може да бъде представено с индивидуални комбинации от цветове, размер на текста или други стилове, за да се улесни четенето. Това изискване също така улеснява други форми на адаптация, включително автоматичното създаване на обобщения и резюмета на страниците, което помага на хората да получат обща представа и да се фокусират по-лесно върху конкретни части.
	</p>

	<h2 class="pt-4 fs-4" tabindex="0">
		Съдържанието да е по-лесно за виждане и слушане
	</h2>

	<p class="pt-4 fs-5" tabindex="0">
		Лесно разпознаваемото съдържание е по-лесно за виждане и слушане. Такова съдържание включва:
	</p>

	<div class="row">
		<div class="col-12">
			<ul tabindex="0">
				<li class=" fs-6" tabindex="0">
					Цветовете да не се използват като единствен начин за предаване на информация или идентифициране на съдържание
				</li>

				<li class="mt-2 fs-6" tabindex="0">
					Подразбиращите се комбинации от преден и заден план предоставят достатъчно контраст
				</li>

				<li class="mt-2 fs-6" tabindex="0">
					Когато потребителите увеличават текста до 400% или променят разстоянието между символите, няма загуба на информация
				</li>

				<li class="mt-2 fs-6" tabindex="0">
					Текстът се преформатира в малки прозорци ("портали") и когато потребителите увеличават размера на текста
				</li>

				<li class="mt-2 fs-6" tabindex="0">
					Изображенията с текст са подлежащи на уголемяване, заменяни с фактически текст или се избягват, където е възможно
				</li>

				<li class="mt-2 fs-6" tabindex="0">
					Потребителите могат да паузират, спират или регулират звука на аудио, което се възпроизвежда на уеб сайта
				</li>

				<li class="mt-2 fs-6" tabindex="0">
					Фоновото аудио е слабо или може да бъде изключено, за да се избегне смущения или разсейване
				</li>
			</ul>
		</div>
	</div>

	<p class="fs-6" tabindex="0">
		Спазването на това изискване помага да се раздели предният план от задния, за да се направи важната информация по-лесно разпознаваема. Това включва обстоятелства за хора, които не използват помощни технологии, и за хора, използващи помощни технологии, които могат да забележат смущения от значимо аудио или визуално съдържание на фона. Например мнозина с далтонизъм не използват специални инструменти и разчитат на правилния дизайн, който осигурява достатъчен контраст между текста и околния фон. За други, аудио, което се възпроизвежда автоматично, може да се намеси с глас към текст или с устройства за подпомагане на слуха (ALDs).
	</p>
	
	<p class="fs-6" tabindex="0">
		Повече информация за точните правила според принципите <a href="https://www.w3.org/WAI/standards-guidelines/wcag/">WCAG</a>, <a href="https://www.w3.org/WAI/standards-guidelines/atag/">ATAG</a>, <a href="https://www.w3.org/WAI/standards-guidelines/uaag/">UAAG</a>; може да се намери в сайта на <a href="https://www.w3.org/WAI/fundamentals/accessibility-principles/#perceivable">W3C Percievable</a> частта. Когато отворите подкатегорията "accessibility requirements" изизат всички правила според принципите за достъпност.
	</p>