
<div class="col-md-9 border border-2 fs-4 flex-column border-dark d-flex rounded-4 me-2 pb-5 " tabindex="0">
	<h2 class="pt-4 fs-4">
		Възприемливост:
	</h2>
	
	<p class="pt-4 fs-6">	
		Информацията и елементите на потребителския интерфейс трябва да се представят по начини, които потребителите могат да възприемат, независимо от техните сетивни способности. Това включва предоставяне на алтернативен текст за изображения, заглавия за видео и ясен цветов контраст за текста.
	</p>  
	
	<p class="pt-4 fs-4">	
		Ето някои ключови аспекти на възприемливата достъпност:
	</p>

	<div class="row fs-6">
		<div class="col-6">
			<p>
				<ul>
					<li>
						Алтернативен текст за не-текстово съдържание
					</li>
					<li class="mt-2">
						Видео и аудио описания
					</li>
					<li class="mt-2"> 
						Контраст на цветовете
					</li>
				</ul>	 
			</p>     
		</div>

		<div class="col-6">
			<p>
				<ul>
					<li>
						Големина на шрифта
					</li>
					<li class="mt-2">
						Подвижност на съдържанието
					</li>
					<li class="mt-2"> 
						Предоставяне на алтернативни средства за комуникация
					</li>
				</ul>	
			</p>     
		</div>
	</div>

	<p class="pt-4 fs-6">	
		Възприемливата достъпност играе ключова роля в осигуряването на равен достъп до информацията и услугите в интернет пространството за всички потребители, независимо от техните специфични нужди или увреждания. При проектирането и разработването на уеб сайтове е от съществено значение да се има предвид този аспект и да се предоставят адекватни решения за постигане на възприемлива достъпност.
	</p>
</div>
