<h2 class="pt-4 fs-4">
Позици в CSS 
</h2>
	

    <p class="pt-4 fs-6">   
        В CSS, позициите определят как елементите на уеб страницата се разполагат спрямо други елементи и как се позиционират в рамките на техните контейнери. Елементите могат да бъдат позиционирани с помощта на свойството position.
    </p>

    <p class="pt-4 fs-5">   
    Свойство Position (Позиция в CSS):
    </p>

    <p class="pt-4 fs-6">   
        Свойството position в CSS определя как елементът се позиционира в рамките на своя контейнер или спрямо други елементи на страницата.
    </p>

<p class="col-12 text-center fs-4 my-3">Стойности на Позиция:</p>

<div class="col-12 row my-3">
    <div class="col-6">
    <ul class="col-12">
        <li class="pt-4 fs-6 col-12">   
            static (По подразбиране): Елементите се позиционират в нормалния поток на документа.
        </li>

        <li class="pt-4 fs-6 col-12">   
            relative (Относително): Елементите се позиционират относително спрямо тяхната нормална позиция.
        </li>

        <li class="pt-4 fs-6 col-12">   
            absolute (Абсолютно): Елементите се позиционират относително спрямо най-близкия ансамбъл с позиция (елемент, чиято позиция не е static).
        </li>

        <li class="pt-4 fs-6 col-12">   
            fixed (Фиксирано): Елементите се позиционират относително спрямо изгледа на прозореца (браузъра).
        </li>

        <li class="pt-4 fs-6 col-12">   
            sticky (Залепващо): Елементите започват като част от нормалния поток, но стават fixed, когато достигнат определена позиция при превъртане.
        </li>

        <li class="pt-4 fs-6 col-12"> 
            Елементите с absolute или fixed позициониране се махат от нормалния поток на документа и други елементи може да ги закриват.
            Използването на relative позициониране позволява на елемента да запази позицията си в нормалния поток, но да се отмести.
            fixed позиционирането често се използва за елементи като заглавия или навигационни менюта, които трябва да останат фиксирани при превъртане.
            sticky позиционирането може да създаде елементи, които изглеждат като "залепени" за горната или долната част на прозореца при превъртане.
        </li>
        
        </div>
    
    <div class="col-6">

    <li class="pt-4 fs-6 col-12">   
        Свойството z-index контролира подредбата на слоевете на позиционираните елементи. Елементите с по-висок z-index се показват над тези с по-нисък.
    </li>

    <li class="pt-4 fs-6 12">   
    Свойства за Офсет (Отместване): <br>
    При използване на позициониране relative, absolute или fixed, можете да използвате свойствата за офсет, за да контролирате позицията на елемент: <br>
    top, right, bottom, left: Задават разстоянието, с което елементът трябва да се отмести от нормалната си позиция.
    </li>

    <li class="pt-4 fs-6 col-12">   
        Позиционирането на елемент се определя често спрямо неговия "блок за позициониране," който се определя от най-близкия позициониран предшественик. Ако няма такъв предшественик, блокът за позициониране е началният блок за позициониране (обикновено прозореца).
    </li>
    
    <li class="pt-4 fs-6 col-12">   
        Офсет Родител (Offset Parent): <br>
        Офсет родителят е най-близкият позициониран предшественик. Той влияе на позиционирането на децата с absolute или fixed  позициониране.
    </li>
    
    <li class="pt-4 fs-6 col-12">
        Практично Използване: 
        CSS позиционирането се използва широко за създаване на сложни макети, подсказки (tooltips), падащи менюта и модални диалози.   
    </li>
    </ul>
    </div>
</div>

    <p class="codepen" data-height="300" data-theme-id="dark" data-default-tab="html,result" data-slug-hash="yLGbqKW" data-editable="true" data-user="obama-max" style="height: 300px; box-sizing: border-box; display: flex; align-items: center; justify-content: center; border: 2px solid; margin: 1em 0; padding: 1em;">
    <span>See the Pen <a href="https://codepen.io/obama-max/pen/yLGbqKW">
    Position example</a> by Darius Popov (<a href="https://codepen.io/obama-max">@obama-max</a>)
    on <a href="https://codepen.io">CodePen</a>.</span>
    </p>
    <script async src="https://cpwebassets.codepen.io/assets/embed/ei.js"></script>

<p class="pt-4 fs-6">   
За кратко, CSS позиционирането позволява контрол на разположението на елементите на уеб страница. Разбирането на различните стойности на position, концепцията за блока за позициониране и как да се използват свойствата за офсет е съществено за прецизен контрол на макетите и създаване на интерактивни уеб дизайни.
</p>	

