<h2 class="pt-4 fs-4">
Cелекторите
</h2>

	<p class="pt-4 fs-6">
   
    CSS селекторите са шаблони, използвани за избор и оформление на HTML елементи в уеб страница. Те ви позволяват да насочите специфични елементи или групи от елементи въз основа на техните атрибути, свойства и йерархия в HTML структурата. Ето подробен преглед на CSS селекторите заедно с примери:	</p>

	<p class="pt-4 fs-4">	
       Примери за селектори:
    </p>	

	<div class="row fs-6">
		<div class="col-6">
			<p>
				<ul>
					<li>
                        Универсален селектор (*): Избира всички елементи на страницата.
                    </li>	

					<li class="mt-2">
                        Типов селектор: Избира елементи по тяхното име на HTML таг.
                    </li>

                    <li class="mt-2">
                        Класов селектор (.клас_име): Избира елементи със специфичен класов атрибут.
                   </li>

                   <li class="mt-2">
                        Селектор на директен наследник (родител > дете): Избира елементи, които са директни деца на специфичен родителски елемент.
                   </li>

                   <li class="mt-2">
                        Псевдо-елементи: Избират определена част от елемент, като първият ред или първата буква на параграф.
                   </li>				
                </ul>	 
			</p>     
		</div>

		<div class="col-6">
			<p>
				<ul>
					<li>
                        Идентификаторен селектор (#идентификатор_име): Избира елемент със специфичен идентификационен атрибут.
                    </li>

					<li class="mt-2">
                        Селектор по атрибут ([атрибут=стойност]): Избира елементи със специфичен атрибут и стойност.
                    </li>

                    <li class="mt-2">
                        Селектор на наследник (родител наследник): Избира елементи, които са наследници на специфичен родителски елемент.
                    </li>

                    <li class="mt-2">
                        Псевдо-класове: Избират елементи въз основа на определено състояние или условие, като :hover за когато потребителят плъзва мишката над елемент.
                    </li>
                </ul>	
			</p>     
		</div>
	</div>	
	
    <p class="codepen" data-height="300" data-theme-id="dark" data-default-tab="html,result" data-slug-hash="poQMaoG" data-editable="true" data-user="obama-max" style="height: 300px; box-sizing: border-box; display: flex; align-items: center; justify-content: center; border: 2px solid; margin: 1em 0; padding: 1em;">
        <span>See the Pen <a href="https://codepen.io/obama-max/pen/poQMaoG">
        Example selectors</a> by Darius Popov (<a href="https://codepen.io/obama-max">@obama-max</a>)
        on <a href="https://codepen.io">CodePen</a>.</span>
    </p>

    <p class="pt-4 fs-6">
    В този пример:

Селекторът * задава margin и padding на 0 за всички елементи на страницата.
Селекторът h1 променя размера на шрифта на елементите h1.
Селекторът .button оформя елементите с клас button.
Селекторът #header оформя елемент с идентификатор header.
Селекторът a:hover променя цвета на връзките при навлизане с мишка.
Селекторът p::first-line прави първия ред на параграфите удебелен.
    </p>