	<h1 class="pt-4 fs-3 d-flex justify-content-center" tabindex="0">
		Стандарти на уеб достъпността:
	</h1>

	<h3 class="pt-4 fs-4 fw-semibold" tabindex="0">
		Уеб достъпността се базира на няколко компонента, които работят заедно. Някои от тях включват:
	</h3>

	<p class="pt-1 fs-6" tabindex="0">
		<span class="fw-semibold">Уеб съдържание</span> - отнася се до всяка част от уеб сайт, включително текст, изображения, форми и мултимедийни елементи, както и css, скриптове, приложения и други подобни.
	</p>

	<p class="pt-1 fs-6" tabindex="0">
		<span class="fw-semibold">Потребителски помощен софтуер</span> - софтуер, който хората използват за достъп до уеб съдържание, включително графични браузъри за настолни компютри, гласови браузъри, мобилни телефонни браузъри, мултимедийни плеъри, добавки и някои помощни технологии.
	</p>

	<p class="pt-1 fs-6" tabindex="0">
		<span class="fw-semibold">Инструменти за създаване на съдържание</span> - софтуер или услуги, които хората използват за производство на уеб съдържание, включително редактори на код, инструменти за конвертиране на документи, системи за управление на съдържание, блогове, скриптове за бази данни и други инструменти.
	</p>

	<p class="pt-4 fs-6" tabindex="0">
		Стандартите играят важна роля в определянето на изискванията за достъпност за всеки от тези компоненти. Някои изисквания за достъпност са лесни за изпълнение, но разбирането на основите за това как хората с увреждания използват уеб пространството помага за по-ефективна и ефективна имплементация. Някои аспекти на достъпността изискват по-технически умения или напреднало познание за начина, по който хората използват уеб пространството.
	</p>

	<h3 class="pt-4 fs-5 fw-medium" tabindex="0">
		Инициативата за уеб достъпност на W3C (Интернет консорциумът за уеб стандарти) предоставя комплект от насоки, които се признават международно като стандарт за уеб достъпност. Тези включват:
	</h3>

	<div class="row fs-6">
		<div class="col-6">
			<p>
				<ul tabindex="0">
					<li tabindex="0">
						Ръководство за достъпност на уеб съдържание (<a href="https://www.w3.org/WAI/standards-guidelines/wcag/">WCAG</a>):
					</li>

					<li class="mt-2" tabindex="0">
						Настройки за достъпност на потребителски агенти (<a href="https://www.w3.org/WAI/standards-guidelines/uaag/">UAAG</a>):
					</li>

					<li class="mt-2" tabindex="0"> 
						Настройки за достъпност на инструменти за създаване на съдържание (<a href="https://www.w3.org/WAI/standards-guidelines/atag/">ATAG</a>):
					</li>

					<li class="mt-2" tabindex="0">
						Също така съществува спецификация на WAI за Достъпни богати интернет приложения (<a href="https://www.w3.org/WAI/">WAI-ARIA</a>), които включват динамично съдържание и напредничави контроли на потребителския интерфейс, разработени с Ajax, JavaScript и свързани уеб технологии.
					</li>
				</ul>	 
			</p>     
		</div>
	</div>
	
	<h2 class="pt-4 fs-4" tabindex="0">
		Ръководство за достъпност на уеб съдържание (WCAG):
	</h2>

	<p class="pt-4 fs-6" tabindex="0">	
		<a href="https://www.w3.org/WAI/standards-guidelines/wcag/">WCAG</a> е набор от насоки, публикувани от Инициативата за уеб достъпност (<a href="https://www.w3.org/WAI/">WAI</a>) на Световния уеб консорциум (<a href="https://www.w3.org/">W3C</a>). Тя предоставя комплексна рамка за увереност, че уеб съдържанието е възприемливо, изпълнимо, разбираемо и надеждно за всички потребители. <a href="https://www.w3.org/WAI/standards-guidelines/wcag/">WCAG</a> е организирана в три нива на съответствие: A, AA и AAA, като най-широко приетото ниво е AA.
	</p>  

	<p class="pt-4 fs-5 fw-medium" tabindex="0">	
		Всеки достъпен уеб сайт трябва да има съответните характеристики:
	</p> 
	
	<div class="row fs-6">
		<div class="col-6">
			<p>
				<ul tabindex="0">
					<li tabindex="0">
						Адаптивен дизайн
					</li>

					<li class="mt-2" tabindex="0">
						Алтернативен текст за не-текстово съдържание
					</li>

					<li class="mt-2" tabindex="0"> 
						Ясна и последователна навигация
					</li>

					<li class="mt-2" tabindex="0">
						Избягване на автоматично възпроизвеждане
					</li>

					<li class="mt-2" tabindex="0">
						Достатъчно време и избягване на времеви ограничения
					</li>

					<li class="mt-2" tabindex="0">
						Съгласуван език и терминология
					</li>

					<li tabindex="0">
						Достъпни формуляри
					</li>

					<li class="mt-2" tabindex="0">
						Аудио и видео описания
					</li>
				</ul>	 
			</p>     
		</div>

		<div class="col-6">
			<p class="pt-4">
				<ul tabindex="0">
					<li class="mt-2" tabindex="0"> 
						Цветов контраст
					</li>

					<li class="mt-2" tabindex="0">
						Избягване на съдържание със светкавици
					</li>

					<li class="mt-2" tabindex="0">
						Съвместимост с помощни технологии
					</li>

					<li class="mt-2" tabindex="0">
						Обучение на уеб разработчици
					</li>

					<li class="mt-2" tabindex="0">
						Тестване с потребители и обратна връзка
					</li>

					<li class="mt-2" tabindex="0">
						Изявления за достъпност
					</li>
				</ul>	
			</p>     
		</div>
	</div>  

	<h2 class="pt-4 fs-4" tabindex="0">
		Настройките за достъпност на потребителски агенти (User Agent Accessibility Guidelines - UAAG):
	</h2>

	
	<p class="pt-4 fs-6" tabindex="0">
		<a href="">UAAG</a> са част от усилията на <a href="">W3C</a> за подобряване на уеб достъпността и създаването на стандарти, които да подпомагат хората с увреждания при използването на различни видове софтуер, наречени "потребителски агенти". Тези насоки се фокусират върху начините, по които софтуерните приложения, използвани от хората за достъп до уеб съдържание, могат да бъдат по-достъпни и удобни за потребителите с увреждания.
	</p>

	<p class="pt-4 fs-6" tabindex="0">
		Потребителските агенти включват разнообразен софтуер, като например настолни браузъри, гласови браузъри, мобилни браузъри, мултимедийни плеъри и дори асистивни технологии като екраниращи програми, които помагат на хората с увреждания да използват компютри и уеб съдържание. <a href="">UAAG</a> цели да подобри достъпността на тези софтуерни приложения, като предоставя насоки и стандарти, които разработчиците може да следват.
	</p>

	<p class="pt-4 fs-5 fw-medium" tabindex="0">	
		Някои от ключовите аспекти, които UAAG адресира, включват:
	</p>

	<div class="row fs-6">
		<div class="col-6">
			<p>
				<ul tabindex="0">
					<li tabindex="0">
						<span class="fw-semibold">Поддръжка на стандарти за достъпност:</span> UAAG насърчава софтуерните приложения да поддържат и следват утвърдените стандарти за уеб достъпност, като например Web Content Accessibility Guidelines (<a href="">WCAG</a>).
					</li>

					<li class="mt-2" tabindex="0">
						<span class="fw-semibold">Навигация и взаимодействие:</span> Насоките препоръчват, че потребителските агенти трябва да предоставят достъпни и удобни методи за навигация и взаимодействие с уеб съдържание, включително възможности за управление с клавиатура, гласови команди и други алтернативни входни методи.
					</li>

					<li class="mt-2" tabindex="0"> 
						<span class="fw-semibold">Визуална и аудио информация:</span> <a href="https://www.w3.org/WAI/standards-guidelines/uaag/">UAAG</a> се стреми да осигури достъп до визуална и аудио информация чрез поддръжка на алтернативни представяния като текстови описания и аудио субтитри.
					</li>

					<li class="mt-2" tabindex="0">
						<span class="fw-semibold">Адаптивност и персонализация:</span> Стандартите насърчават софтуерните приложения да предоставят възможности за адаптивност и персонализация на интерфейса, които да отговарят на индивидуалните нужди на потребителите.
					</li>

					<li class="mt-2" tabindex="0">
						<span class="fw-semibold">Поддръжка на асистивни технологии:</span> <a href="https://www.w3.org/WAI/standards-guidelines/uaag/">UAAG</a> насърчава интеграцията на функционалности, които поддържат работата с асистивни технологии, като например екраниращи програми и четци на съдържание.
					</li>
				</ul>	 
			</p>     
		</div>
	</div> 

	<h2 class="pt-4 fs-4" tabindex="0">
	Настройките за достъпност на инструменти за създаване на съдържание (Authoring Tool Accessibility Guidelines - ATAG):
	</h2>

	<p class="pt-4 fs-6" tabindex="0"><a href="https://www.w3.org/WAI/standards-guidelines/atag/">ATAG</a> са също част от усилията на W3C за подобряване на уеб достъпността. Те се фокусират върху начините, по които софтуерните инструменти, използвани от автори и създатели на уеб съдържание, могат да бъдат по-достъпни и поддържаеми, за да се създава уеб съдържание, което е по-лесно за разбиране и използване от хора с увреждания.</p>

	<p class="fs-6" tabindex="0">Създаването на достъпно уеб съдържание е от съществено значение, и <a href="https://www.w3.org/WAI/standards-guidelines/atag/">ATAG</a> цели да предостави на разработчиците на инструменти насоки и стандарти, които да ги насърчат да създават софтуер с вградени функционалности за подпомагане на достъпността.</p>

	<div class="row">
		<div class="col-6">
			<p class="pt-4 fs-5 fw-medium" tabindex="0">
				Някои от ключовите аспекти, които ATAG адресира, включват:
			</p>

			<p class="pt-4 ">
				<ul tabindex="0">
					<li class="fs-6" tabindex="0">
						<span class="fw-semibold">Поддръжка на стандарти за достъпност:</span><a href="https://www.w3.org/WAI/standards-guidelines/atag/">ATAG</a> насърчава инструментите за създаване на съдържание да предоставят функционалности, които помагат на авторите да създават съдържание, съответстващо на утвърдените стандарти за уеб достъпност, като например Web Content Accessibility Guidelines (<a href="https://www.w3.org/WAI/standards-guidelines/wcag/">WCAG</a>).
					</li>

					<li class="mt-2 fs-6" tabindex="0">
						<span class="fw-semibold">Поддръжка на удобен интерфейс за достъпност:</span> <a href="https://www.w3.org/WAI/standards-guidelines/atag/">ATAG</a> насърчава създаването на интуитивен и достъпен потребителски интерфейс на инструментите, които да подпомагат авторите при създаването на достъпно съдържание.
					</li>

					<li class="mt-2 fs-6" tabindex="0">
						<span class="fw-semibold">Управление на алтернативни текстове и мултимедия:</span> Насоките препоръчват, че инструментите трябва да предоставят средства за добавяне на алтернативен текст за изображения и мултимедийни елементи, които са важни за разбирането на съдържанието от хора с увреждания.
					</li>

					<li class="mt-2 fs-6" tabindex="0">
						<span class="fw-semibold">Проверка на достъпността и подаване на съобщения за грешки:</span> <a href="https://www.w3.org/WAI/standards-guidelines/atag/">ATAG</a> подчертава значението на инструментите да предоставят възможности за автоматична проверка на достъпността и да информират авторите за евентуални нарушения.
					</li>

					<li class="mt-2 fs-6" tabindex="0">
						<span class="fw-semibold">Асистивни функции за авторите:</span> Насоките насърчават инструментите да предоставят помощни средства и функции за авторите, които им помагат да създават достъпно съдържание.
					</li>
				</ul>
			</p>
		</div>

		<div class="col-6">
			<a href="https://www.w3.org/WAI/fundamentals/accessibility-principles" tabindex="0">
				<img style="width: 762.47px; height: 496.05px;" src="assets/images/Summary-of-ATAG-20-WCAG-21-UAAG-20-proposed-by-the-WAI-of-W3C.jpg" alt="Снимка показваща различните принципи на достъпността и линк към повече информация">
			</a>
		</div>
	</div>
	

	
	 

	 

	 

