<h2 class="pt-4 fs-2">
HTML Основи и Структура
</h2>

    <p class="pt-4 fs-4">   
    HTML (Hypertext Markup Language) е стандартен език за маркиране, който се използва за създаване на уеб страници. Този език позволява на уеб разработчиците да структурират и форматират информацията, която браузърите изобразяват на екрана на потребителите. Важно е да разберете някои основни концепции:
    </p>

    
	<p class="pt-4 fs-6">	
     1 - HTML Документ и Основен Синтаксис:

HTML документът е текстов файл, който съдържа код написан на HTML езика. Този код съдържа HTML елементи и тагове.
HTML елементите са съставни части от уеб страницата, които се определят с тагове. Примери на тагове са &lt;p> за абзаци, &lt;h1> за заглавия, и &lt;a> за връзки.
Основният синтаксис включва отварящ таг, съдържание и затварящ таг, като например &lt;p>Това е текст&lt;/p>. Отварящите и затварящите тагове трябва да съвпадат.
    </p>	

    <p class="pt-4 fs-6">	
    2 -Структура на HTML Документа:

HTML документът започва с декларация за типа на документа (DOCTYPE), която определя версията на HTML, която се използва. Например: &lt;!DOCTYPE html>.
&lt;html> елементът е кореновият елемент на HTML документа и определя началото и края на уеб страницата.
&lt;head> секцията съдържа метаданни за документа, като заглавие, кодировка и линкове към външни стилове и скриптове.
&lt;body> секцията съдържа видимото съдържание на уеб страницата, включително текст, изображения, и други медийни елементи.
    </p>	


    <img src="./assets/images/html1.png" alt="example showing of shematic html">

    <p class="pt-4 fs-6">	
    3 -Основни HTML Елементи:

Основни HTML елементи включват:
Заглавия (&lt;h1>, &lt;h2>, ..., &lt;h6>) за структуриране на текста.
Абзаци (&lt;p>) за текстово съдържание.
Връзки (&lt;a>) за създаване на хипервръзки към други страници.
Списъци (&lt;ul>, &lt;ol>, &lt;li>) за представяне на списъци от елементи.
Изображения (&lt;img>) за вмъкване на графични файлове.
Важно е да се отбележи, че HTML има и семантични елементи като &lt;header>, &lt;nav>, &lt;main> и &lt;footer>, които се използват за подобряване на структурата и семантиката на документа.
    </p>	

    <p class="pt-4 fs-6">	
    4 - Форми в HTML и Входни Данни от Потребителя:

HTML формите ( &lt;form>) са от съществено значение за събирането на входни данни от потребителите, като текст, избори и изпращане на информация.
Научете се как се използват различни елементи за форми, като текстови полета ( &lt;input type="text">), радио бутони ( &lt;input type="radio">), отметки ( &lt;input type="checkbox">) и падащи списъци ( &lt;select>).
Разберете формалите атрибути, като "action" и "method", които определят къде и как се обработват данните от формата.
Изучете как да извършвате валидация на формите и как да гарантирате точност и сигурност на данните, предоставени от потребителите.
Открийте как да създадете бутони и да управлявате изпращането на формулярите с  &lt;button> и  &lt;input type="submit">.
    </p>	

	
    
  

    <p class="pt-4 fs-6">
    Това са основите на HTML. Като научите тези концепции, ще можете да създавате основни уеб страници със структурирано съдържание и форматиране. В бъдеще може да разширите знанията си, като изучавате напреднали теми като форми, таблици, CSS и JavaScript, за да създавате по-сложни и интерактивни уеб приложения.

    </p>
