<h2 class="pt-4 fs-4">
Таблиците в HTML
</h2>

		

    <p class="pt-4 fs-6">   

    Таблиците в HTML се използват, за да представят данни в упорядочен и структуриран вид. Те са полезни за създаване на различни видове информационни таблици, като таблици с данни, календари, и други подобни структури. В този пълен гайд ще разгледаме всичко, което трябва да знаете за таблиците в HTML.


    </p>

   

    <p class="pt-4 fs-6">   

    Таблиците в HTML се състоят от няколко основни елемента:
    </p>	


   
	<div class="col-12">
		<ul>
			<li class="fs-6">

            &lt;table>: Основният елемент, който обвива цялата таблица.

            </li>
			
			<li class="mt-2 fs-6">

            &lt;tr>: Редовете на таблицата (table row).

			</li>
			
			<li class="mt-2 fs-6">

            &lt;td>: Клетките в редовете (table data cell).

            </li>
			
			<li class="mt-2 fs-6">

            &lt;th>: Заглавните клетки, които обикновено се използват за озаглавяване на колоните или редовете.

			</li>
			
		</ul>
	</div>

   


    <div class="col-12">

    <p class="pt-4 fs-5">
    Ето как можем да създадем проста таблица:    
    </p>


    <p class="codepen" data-height="300" data-theme-id="dark" data-default-tab="html,result" data-slug-hash="vYvGdPM" data-editable="true" data-user="obama-max" style="height: 300px; box-sizing: border-box; display: flex; align-items: center; justify-content: center; border: 2px solid; margin: 1em 0; padding: 1em;">
  <span>See the Pen <a href="https://codepen.io/obama-max/pen/vYvGdPM">
  Untitled</a> by Darius Popov (<a href="https://codepen.io/obama-max">@obama-max</a>)
  on <a href="https://codepen.io">CodePen</a>.</span>
</p>
<script async src="https://cpwebassets.codepen.io/assets/embed/ei.js"></script>
    

<p class="pt-4 fs-6">   

Таблиците в HTML се състоят от няколко основни елемента:
</p>	

<ol>
			<li class="fs-6">

            &lt;table>: Това е HTML елемент, който дефинира таблица.

            </li>
			
			<li class="mt-2 fs-6">

            &lt;caption>: Това е заглавие на таблицата. В този случай е "Таблица с продажби" на български. То се изобразява най-горе в таблицата и предоставя заглавие или описание на таблицата.

			</li>
			
			<li class="mt-2 fs-6">

            &lt;tr>: Това са елементи за редове на таблицата. В тази таблица са дефинирани два реда.

            </li>
			
			<li class="mt-2 fs-6">

            &lt;th>: Това са клетки за заглавия на колони. Те имат съдържание "Заглавие 1" и "Заглавие 2".

			</li>
			
            <li class="mt-2 fs-6">

            table: Това стилизира самата таблица.

            width: 100%;: Това задава ширина на таблицата от 100% от съдържащия я елемент.
            border-collapse: collapse;: Този стил обединява границите на съседни клетки в една граница, което придава на таблицата по-компактен вид.
			</li>
			
			<li class="mt-2 fs-6">

            th, td: Тези стилове се прилагат и към клетки за заглавия (th) и клетки за данни (td).

            border: 2px solid black;: Това задава черна, плътна граница с ширина 2px около всяка клетка.
            padding: 8px;: Това добавя 8 пиксела падинг вътре във всяка клетка, което придава на съдържанието някакво пространство от границата на          клетката.
            background-color: lightblue;: Това задава фонов цвят на клетките в светло синьо.
            text-align: left;: Това насочва текста вътре в клетките вляво.
            </li>
			
			<li class="mt-2 fs-6">

            caption: Този стил се прилага към заглавието на таблицата.

            font-size: 25px;: Това задава размер на шрифта на заглавието на таблицата от 25 пиксела.
            margin-bottom: 1%;: Това добавя 1% маргина отдолу на заглавието, осигурявайки разстояние между заглавието и таблицата.
			</li>
</ol>

</div>


<p class="pt-4 fs-6">   

За да осигурите, че вашата таблица се представя добре на различни устройства, използвайте CSS медийни заявки и управлявайте размерите на колоните и редовете, така че таблицата да бъде четлива.


</p>	


<p class="pt-4 fs-6">   

Таблиците са мощен инструмент за представяне на данни в уеб страниците. Като разберете структурата и основните атрибути за създаване на таблица в HTML, можете да създадете информативни и добре структурирани уеб страници. Внимателно използване на атрибути за достъпност и стилове може да подобри визуалния и функционален аспект на вашите таблиците, като гарантира, че те са удобни за всички потребители.

</p>	

