
	<h2 class="pt-4 fs-4">
		Тестване и проверка:
	</h2>
	
	<p class="pt-4 fs-6" >	
		Редовното тестване на уеб сайтове с помощни технологии и проверката за проблеми с достъпността е от съществено значение, за да се идентифицират и отстранят потенциални бариери за достъпност.
	</p>   
	  
	<p class="pt-4 fs-4">	
		Ето някои ключови аспекти на тестването на достъпността:
	</p>

	<div class="row fs-6">
		<div class="col-6">
			<p>
				<ul>
					<li>
						Използване на помощни технологии
					</li>
					<li class="mt-2">
						Използване на различни браузъри и устройства
					</li>
					<li class="mt-2"> 
						Тестване на клавиатурната навигация
					</li>
				</ul>	 
			</p>     
		</div>

		<div class="col-6">
			<p>
				<ul>
					<li>
						Проверка на съответствие с <a href="https://www.w3.org/WAI/standards-guidelines/wcag/">WCAG</a> стандартите
					</li>
					<li class="mt-2">
						Тестване с реални потребители
					</li>
					<li class="mt-2">
						Използване на инструменти за тестване
					</li>
				</ul>	
			</p>     
		</div>
	</div>

	<p class="pt-4 fs-6">	
		Тестването на достъпността е процес, който трябва да бъде извършван редовно, за да се гарантира, че уеб сайтовете са винаги достъпни и удобни за всички потребители. При проектирането и разработката на уеб сайтове е важно да се обърне специално внимание на тестването на достъпността и да се използват подходящи методи и инструменти, за да се осигури оптимална достъпност за всички потребители.
	</p>
