
	<h1 class="pt-4 fs-3 d-flex justify-content-center" tabindex="0">
		Разбираемостта в достъпността:
	</h1>
	
	<p class="pt-4 fs-6" tabindex="0">	
		Информацията и операциите на потребителския интерфейс трябва да бъдат ясни и лесно разбираеми. Това включва използване на разбираем език, консистентна навигация и избягване на сложни жаргонизми.
	</p>
	
	<p class="fs-6" tabindex="0">	
		Разбираемата достъпност играе важна роля за улесняването на интеракцията и използването на уеб сайтовете от всички потребители, включително тези с когнитивни увреждания или затруднения в разбирането на информация. При проектирането на уеб сайтове, е важно да се обърне специално внимание на този аспект, за да се осигури, че съдържанието и функционалността са представени по възможно най-разбираем и достъпен начин.
	</p> 

	<h2 class="fs-4" tabindex="0">
		Текстът да е четим и разбираем.
	</h2>

	<p class="pt-4 fs-6" tabindex="0">
		Създателите на съдържание трябва да се уверят, че текстовото съдържание е четимо и разбираемо от най-широката аудитория възможно, включително когато се чете на глас от текст-към-говор системи. 
	</p>

	<p class="fs-5" tabindex="0">
		Такова съдържание включва:
	</p>

	<div class="row">
		<div class="col-12">
			<ul tabindex="0">
				<li class="fs-6" tabindex="0">
					Идентифициране на основния език на уеб страница, като например арабски, холандски или корейски
				</li>

				<li class="mt-2 fs-6" tabindex="0">
					Идентифициране на езика на текстови пасажи, фрази или други части на уеб страница
				</li>

				<li class="mt-2 fs-6" tabindex="0">
					Предоставяне на дефиниции за всякакви необичайни думи, фрази, идиоми и съкращения
				</li>

				<li class="mt-2 fs-6" tabindex="0">
					Използване на най-ясния и най-прост език, или предоставяне на опростени версии
				</li>
			</ul>
		</div>
	</div>

	<p class="fs-6" tabindex="0">
		Изпълнението на това изискване помага на софтуерните приложения, включително и на помощните технологии, да обработват текстовото съдържание правилно. Например, това изискване помага на софтуерните приложения да четат съдържанието на глас, да генерират резюмета на страницата и да предоставят дефиниции за необичайни думи като технически жаргон. То също така помага на хората, които имат затруднения с разбирането на по-сложни изречения, фрази и лексика. По-конкретно, то помага на хора с различни видове когнитивни увреждания.
	</p>

	<h2 class="fs-4" tabindex="0">
		Съдържанието се появява и функционира по предвидим начин.
	</h2>

	<p class="pt-4 fs-6" tabindex="0">
		Мнозина се доверяват на предвидими потребителски интерфейси и се объркват или отклоняват от несъгласувания външен вид или поведение. 
	</p>
	
	<p class="fs-5" tabindex="0">
		Примери за по-голяма предвидимост на съдържанието включват:
	</p>

	<div class="row">
		<div class="col-12">
			<ul tabindex="0">
				<li class="fs-6" tabindex="0">
					Навигационни механизми, които се повтарят на множество страници, се появяват в същото място всеки път
				</li>


				<li class="mt-2 fs-6" tabindex="0">
					Компоненти на потребителския интерфейс, които се повтарят на уеб страниците, имат същите етикети всяка път
				</li>

				
				<li class="mt-2 fs-6" tabindex="0">
					Значителни промени на уеб страница не се случват без съгласието на потребителя
				</li>
			</ul>
		</div>
	</div>


	<p class="fs-6" tabindex="0">
		Изпълнението на това изискване помага на хората бързо да научат функционалността и навигационните механизми, предоставени на уебсайта, и да ги използват в съответствие със своите специфични нужди и предпочитания. Например, някои хора присвояват персонализирани бързи клавиши за функции, които използват често, за да подобрят навигацията с клавиатурата. Други запомнят стъпките за достигане до определени страници или за завършване на процеси на уебсайт. И двата случая се основават на предвидима и последователна функционалност.
	</p>

	<h2 class="fs-4" tabindex="0">
		Потребителите се помагат да избегнат и коригират грешки.
	</h2>

	<p class="pt-4 fs-6" tabindex="0">
		Формулярите и другите взаимодействия могат да бъдат объркващи или трудни за употреба за много хора и, вследствие на това, те може да са по-склонни да правят грешки.
	</p>

	<p class="fs-5" tabindex="0">
		Примери за помощ на потребителите да избегнат и коригират грешки включват:
	</p>

	<div class="row">
		<div class="col-12">
			<ul tabindex="0">
				<li class="fs-6" tabindex="0">
					Описателни инструкции, съобщения за грешки и предложения за корекция
				</li>

				<li class="mt-2 fs-6" tabindex="0">
					Контекстуална помощ за по-сложни функции и взаимодействия
				</li>

				<li class="mt-2 fs-6" tabindex="0">
					Възможност за преглед, корекция или отмяна на изпращанията при нужда
				</li>
			</ul>
		</div>
	</div>

	<p class="fs-6" tabindex="0">
		Изпълнението на това изискване помага на хора, които не виждат или не чуват съдържанието и може би не разпознават подразбиращи се връзки, последователности и други индикации. То също помага на хора, които не разбират функционалността, са объркани или объркани, забравят или правят грешки при използването на формуляри и взаимодействия по всяка друга причина.
	</p>

	<p class="fs-6" tabindex="0">
		Повече информация за точните правила според принципите <a href="https://www.w3.org/WAI/standards-guidelines/wcag/">WCAG</a>, <a href="https://www.w3.org/WAI/standards-guidelines/atag/">ATAG</a>, <a href="https://www.w3.org/WAI/standards-guidelines/uaag/">UAAG</a>; може да се намери в сайта на <a href="https://www.w3.org/WAI/fundamentals/accessibility-principles/#perceivable">W3C Percievable</a> частта. Когато отворите подкатегорията "accessibility requirements" изизат всички правила според принципите за достъпност.
	</p>





