<h2 class="pt-4 fs-4">
		Уебстраница
	</h2>

	<p class="pt-4 fs-6">
       При създаването на нов уебсайт или страница е важно да се замислим колко хубав и удобен е сайта за навигиране, но също така трябва да се осигорим че се представя добре. Една от най-големите причини за напускане на сайт е колко бърз е той самият. Метриките по които се решава колко бърз е нашият са най-голямата видима загрузка на съдържание (Largest Contentful Paint - LCP), Първоначално Забавяне на Вход (First Input Delay - FID) и Кумулативно Зместване на Оформлението (Cumulative Layout Shift - CLS) са всички метрики, които се използват за измерване на различни аспекти на производителността и потребителския опит на уебсайт. Тези метрики са особено важни за уеб разработчиците и собствениците на сайтове, за да гарантират, че техните уебсайтове се зареждат бързо, реагират плавно на потребителските взаимодействия и предоставят визуално стабилно изживяване. 
	</p>

    <img src="./assets/images/SEO10.jpg" style="height: 350px; width: 500px; margin-left: 25%;" alt="lul">

	<p class="pt-4 fs-4">	
		Ето някои ключови аспекти за Largest Contentful Paint (LCP),  First Input Delay (FID) ,  Cumulative Layout Shift (CLS) :
	</p>	

	<div class="row fs-6">
		<div class="col-12">
			<p>
				<ul>
					<li>
                        Най-голяма видима загрузка на съдържание (Largest Contentful Paint - LCP): LCP измерва производителността на зареждане на уеб страница. Конкретно се фокусира върху времето, което отнема на най-големият елемент на съдържание (като изображение или блок с текст) във видимата част на екрана да се зареди и да се покаже напълно. Добър резултат при LCP означава, че основното съдържание на страницата се зарежда бързо, позволявайки на потребителите да го видят и взаимодействат с него по-рано.
					</li>	

					<li class="mt-2">
                        Първоначално Забавяне на Вход (First Input Delay - FID): FID измерва възможността за взаимодействие на уеб страница. Тя измерва времето, което отнема на първото взаимодействие на потребителя (като кликване на бутон или въвеждане на текст) да предизвика реакция от страницата. Нисък резултат при FID означава, че страницата реагира бързо и потребителските взаимодействия се обработват бързо, което допринася за по-гладко и ангажиращо потребителско изживяване.
					</li>	

					<li class="mt-2"> 
                        Кумулативно Зместване на Оформлението (Cumulative Layout Shift - CLS): CLS измерва визуалната стабилност на уеб страница. Тя оценява колко се движат оформлението и съдържанието по време на процеса на зареждане. Движенията в оформлението могат да бъдат дразнещи за потребителите, особено когато елементите се движат неочаквано и причиняват непреднамерени кликвания или взаимодействия. Нисък резултат при CLS означава, че елементите на страницата са относително стабилни по време на зареждането, което подобрява потребителския опит.
					</li>                                                   
				</ul>	 
			</p>     
		</div>
		
	</div>	
